/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const __SLBF: u32 = 1;
pub const __SNBF: u32 = 2;
pub const __SRD: u32 = 4;
pub const __SWR: u32 = 8;
pub const __SRW: u32 = 16;
pub const __SEOF: u32 = 32;
pub const __SERR: u32 = 64;
pub const __SMBF: u32 = 128;
pub const __SAPP: u32 = 256;
pub const __SSTR: u32 = 512;
pub const __SOPT: u32 = 1024;
pub const __SNPT: u32 = 2048;
pub const __SOFF: u32 = 4096;
pub const __SMOD: u32 = 8192;
pub const __SALC: u32 = 16384;
pub const __SIGN: u32 = 32768;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 1;
pub const _IONBF: u32 = 2;
pub const BUFSIZ: u32 = 1024;
pub const EOF: i32 = -1;
pub const FOPEN_MAX: u32 = 20;
pub const FILENAME_MAX: u32 = 1024;
pub const P_tmpdir: &[u8; 10] = b"/var/tmp/\0";
pub const L_tmpnam: u32 = 1024;
pub const TMP_MAX: u32 = 308915776;
pub const L_ctermid: u32 = 1024;
pub const _USE_FORTIFY_LEVEL: u32 = 2;
pub const IGRAPH_PRId: &[u8; 4] = b"lld\0";
pub const IGRAPH_PRIu: &[u8; 4] = b"llu\0";
pub const IGRAPH_INTEGER_MAX: u64 = 9223372036854775807;
pub const IGRAPH_INTEGER_MIN: i64 = -9223372036854775808;
pub const IGRAPH_UINT_MAX: i32 = -1;
pub const IGRAPH_VCOUNT_MAX: u64 = 9223372036854775806;
pub const IGRAPH_ECOUNT_MAX: u64 = 4611686018427387903;
pub const IGRAPH_UNLIMITED: i32 = -1;
pub const OUT_FORMAT: &[u8; 3] = b"%g\0";
pub const ZERO: f64 = 0.0;
pub const ONE: f64 = 1.0;
pub const MULTIPLICITY: u32 = 1;
pub const NOTORDERED: u32 = 1;
pub const NOABS: u32 = 1;
pub const IGRAPH_SHORTEST_PATH_EPSILON: f64 = 0.0000000001;
pub const IGRAPH_THREAD_SAFE: u32 = 1;
unsafe extern "C" {
    pub fn igraph_version(
        version_string: *mut *const ::std::os::raw::c_char,
        major: *mut ::std::os::raw::c_int,
        minor: *mut ::std::os::raw::c_int,
        patch: *mut ::std::os::raw::c_int,
    );
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
pub type pid_t = __darwin_pid_t;
pub type id_t = __darwin_id_t;
pub type sig_atomic_t = ::std::os::raw::c_int;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state {
    pub __exception: __uint32_t,
    pub __fsr: __uint32_t,
    pub __far: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state"]
        [::std::mem::size_of::<__darwin_arm_exception_state>() - 12usize];
    ["Alignment of __darwin_arm_exception_state"]
        [::std::mem::align_of::<__darwin_arm_exception_state>() - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __exception) - 0usize];
    ["Offset of field: __darwin_arm_exception_state::__fsr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __fsr) - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __far) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state64 {
    pub __far: __uint64_t,
    pub __esr: __uint32_t,
    pub __exception: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state64"]
        [::std::mem::size_of::<__darwin_arm_exception_state64>() - 16usize];
    ["Alignment of __darwin_arm_exception_state64"]
        [::std::mem::align_of::<__darwin_arm_exception_state64>() - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __far) - 0usize];
    ["Offset of field: __darwin_arm_exception_state64::__esr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __esr) - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __exception) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state64_v2 {
    pub __far: __uint64_t,
    pub __esr: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state64_v2"]
        [::std::mem::size_of::<__darwin_arm_exception_state64_v2>() - 16usize];
    ["Alignment of __darwin_arm_exception_state64_v2"]
        [::std::mem::align_of::<__darwin_arm_exception_state64_v2>() - 8usize];
    ["Offset of field: __darwin_arm_exception_state64_v2::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64_v2, __far) - 0usize];
    ["Offset of field: __darwin_arm_exception_state64_v2::__esr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64_v2, __esr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state {
    pub __r: [__uint32_t; 13usize],
    pub __sp: __uint32_t,
    pub __lr: __uint32_t,
    pub __pc: __uint32_t,
    pub __cpsr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state"]
        [::std::mem::size_of::<__darwin_arm_thread_state>() - 68usize];
    ["Alignment of __darwin_arm_thread_state"]
        [::std::mem::align_of::<__darwin_arm_thread_state>() - 4usize];
    ["Offset of field: __darwin_arm_thread_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_thread_state::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __sp) - 52usize];
    ["Offset of field: __darwin_arm_thread_state::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __lr) - 56usize];
    ["Offset of field: __darwin_arm_thread_state::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __pc) - 60usize];
    ["Offset of field: __darwin_arm_thread_state::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __cpsr) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state64 {
    pub __x: [__uint64_t; 29usize],
    pub __fp: __uint64_t,
    pub __lr: __uint64_t,
    pub __sp: __uint64_t,
    pub __pc: __uint64_t,
    pub __cpsr: __uint32_t,
    pub __pad: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state64"]
        [::std::mem::size_of::<__darwin_arm_thread_state64>() - 272usize];
    ["Alignment of __darwin_arm_thread_state64"]
        [::std::mem::align_of::<__darwin_arm_thread_state64>() - 8usize];
    ["Offset of field: __darwin_arm_thread_state64::__x"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __x) - 0usize];
    ["Offset of field: __darwin_arm_thread_state64::__fp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __fp) - 232usize];
    ["Offset of field: __darwin_arm_thread_state64::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __lr) - 240usize];
    ["Offset of field: __darwin_arm_thread_state64::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __sp) - 248usize];
    ["Offset of field: __darwin_arm_thread_state64::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pc) - 256usize];
    ["Offset of field: __darwin_arm_thread_state64::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __cpsr) - 264usize];
    ["Offset of field: __darwin_arm_thread_state64::__pad"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pad) - 268usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_vfp_state {
    pub __r: [__uint32_t; 64usize],
    pub __fpscr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_vfp_state"][::std::mem::size_of::<__darwin_arm_vfp_state>() - 260usize];
    ["Alignment of __darwin_arm_vfp_state"]
        [::std::mem::align_of::<__darwin_arm_vfp_state>() - 4usize];
    ["Offset of field: __darwin_arm_vfp_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_vfp_state::__fpscr"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __fpscr) - 256usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state64 {
    pub __v: [__uint128_t; 32usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state64"]
        [::std::mem::size_of::<__darwin_arm_neon_state64>() - 528usize];
    ["Alignment of __darwin_arm_neon_state64"]
        [::std::mem::align_of::<__darwin_arm_neon_state64>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state64::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpsr) - 512usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpcr) - 516usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state {
    pub __v: [__uint128_t; 16usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state"]
        [::std::mem::size_of::<__darwin_arm_neon_state>() - 272usize];
    ["Alignment of __darwin_arm_neon_state"]
        [::std::mem::align_of::<__darwin_arm_neon_state>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpsr) - 256usize];
    ["Offset of field: __darwin_arm_neon_state::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpcr) - 260usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_pagein_state {
    pub __pagein_error: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_pagein_state"][::std::mem::size_of::<__arm_pagein_state>() - 4usize];
    ["Alignment of __arm_pagein_state"][::std::mem::align_of::<__arm_pagein_state>() - 4usize];
    ["Offset of field: __arm_pagein_state::__pagein_error"]
        [::std::mem::offset_of!(__arm_pagein_state, __pagein_error) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sme_state {
    pub __svcr: __uint64_t,
    pub __tpidr2_el0: __uint64_t,
    pub __svl_b: __uint16_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sme_state"][::std::mem::size_of::<__darwin_arm_sme_state>() - 24usize];
    ["Alignment of __darwin_arm_sme_state"]
        [::std::mem::align_of::<__darwin_arm_sme_state>() - 8usize];
    ["Offset of field: __darwin_arm_sme_state::__svcr"]
        [::std::mem::offset_of!(__darwin_arm_sme_state, __svcr) - 0usize];
    ["Offset of field: __darwin_arm_sme_state::__tpidr2_el0"]
        [::std::mem::offset_of!(__darwin_arm_sme_state, __tpidr2_el0) - 8usize];
    ["Offset of field: __darwin_arm_sme_state::__svl_b"]
        [::std::mem::offset_of!(__darwin_arm_sme_state, __svl_b) - 16usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sve_z_state {
    pub __z: [[::std::os::raw::c_char; 256usize]; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sve_z_state"]
        [::std::mem::size_of::<__darwin_arm_sve_z_state>() - 4096usize];
    ["Alignment of __darwin_arm_sve_z_state"]
        [::std::mem::align_of::<__darwin_arm_sve_z_state>() - 4usize];
    ["Offset of field: __darwin_arm_sve_z_state::__z"]
        [::std::mem::offset_of!(__darwin_arm_sve_z_state, __z) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sve_p_state {
    pub __p: [[::std::os::raw::c_char; 32usize]; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sve_p_state"]
        [::std::mem::size_of::<__darwin_arm_sve_p_state>() - 512usize];
    ["Alignment of __darwin_arm_sve_p_state"]
        [::std::mem::align_of::<__darwin_arm_sve_p_state>() - 4usize];
    ["Offset of field: __darwin_arm_sve_p_state::__p"]
        [::std::mem::offset_of!(__darwin_arm_sve_p_state, __p) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sme_za_state {
    pub __za: [::std::os::raw::c_char; 4096usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sme_za_state"]
        [::std::mem::size_of::<__darwin_arm_sme_za_state>() - 4096usize];
    ["Alignment of __darwin_arm_sme_za_state"]
        [::std::mem::align_of::<__darwin_arm_sme_za_state>() - 4usize];
    ["Offset of field: __darwin_arm_sme_za_state::__za"]
        [::std::mem::offset_of!(__darwin_arm_sme_za_state, __za) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sme2_state {
    pub __zt0: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sme2_state"][::std::mem::size_of::<__darwin_arm_sme2_state>() - 64usize];
    ["Alignment of __darwin_arm_sme2_state"]
        [::std::mem::align_of::<__darwin_arm_sme2_state>() - 4usize];
    ["Offset of field: __darwin_arm_sme2_state::__zt0"]
        [::std::mem::offset_of!(__darwin_arm_sme2_state, __zt0) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_legacy_debug_state {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_legacy_debug_state"]
        [::std::mem::size_of::<__arm_legacy_debug_state>() - 256usize];
    ["Alignment of __arm_legacy_debug_state"]
        [::std::mem::align_of::<__arm_legacy_debug_state>() - 4usize];
    ["Offset of field: __arm_legacy_debug_state::__bvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bvr) - 0usize];
    ["Offset of field: __arm_legacy_debug_state::__bcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bcr) - 64usize];
    ["Offset of field: __arm_legacy_debug_state::__wvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wvr) - 128usize];
    ["Offset of field: __arm_legacy_debug_state::__wcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wcr) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state32 {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state32"]
        [::std::mem::size_of::<__darwin_arm_debug_state32>() - 264usize];
    ["Alignment of __darwin_arm_debug_state32"]
        [::std::mem::align_of::<__darwin_arm_debug_state32>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state32::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state32::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bcr) - 64usize];
    ["Offset of field: __darwin_arm_debug_state32::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wvr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state32::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wcr) - 192usize];
    ["Offset of field: __darwin_arm_debug_state32::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __mdscr_el1) - 256usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state64 {
    pub __bvr: [__uint64_t; 16usize],
    pub __bcr: [__uint64_t; 16usize],
    pub __wvr: [__uint64_t; 16usize],
    pub __wcr: [__uint64_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state64"]
        [::std::mem::size_of::<__darwin_arm_debug_state64>() - 520usize];
    ["Alignment of __darwin_arm_debug_state64"]
        [::std::mem::align_of::<__darwin_arm_debug_state64>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state64::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state64::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bcr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state64::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wvr) - 256usize];
    ["Offset of field: __darwin_arm_debug_state64::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wcr) - 384usize];
    ["Offset of field: __darwin_arm_debug_state64::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __mdscr_el1) - 512usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_cpmu_state64 {
    pub __ctrs: [__uint64_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_cpmu_state64"]
        [::std::mem::size_of::<__darwin_arm_cpmu_state64>() - 128usize];
    ["Alignment of __darwin_arm_cpmu_state64"]
        [::std::mem::align_of::<__darwin_arm_cpmu_state64>() - 8usize];
    ["Offset of field: __darwin_arm_cpmu_state64::__ctrs"]
        [::std::mem::offset_of!(__darwin_arm_cpmu_state64, __ctrs) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext32 {
    pub __es: __darwin_arm_exception_state,
    pub __ss: __darwin_arm_thread_state,
    pub __fs: __darwin_arm_vfp_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext32"][::std::mem::size_of::<__darwin_mcontext32>() - 340usize];
    ["Alignment of __darwin_mcontext32"][::std::mem::align_of::<__darwin_mcontext32>() - 4usize];
    ["Offset of field: __darwin_mcontext32::__es"]
        [::std::mem::offset_of!(__darwin_mcontext32, __es) - 0usize];
    ["Offset of field: __darwin_mcontext32::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext32, __ss) - 12usize];
    ["Offset of field: __darwin_mcontext32::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext32, __fs) - 80usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext64 {
    pub __es: __darwin_arm_exception_state64,
    pub __ss: __darwin_arm_thread_state64,
    pub __ns: __darwin_arm_neon_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext64"][::std::mem::size_of::<__darwin_mcontext64>() - 816usize];
    ["Alignment of __darwin_mcontext64"][::std::mem::align_of::<__darwin_mcontext64>() - 16usize];
    ["Offset of field: __darwin_mcontext64::__es"]
        [::std::mem::offset_of!(__darwin_mcontext64, __es) - 0usize];
    ["Offset of field: __darwin_mcontext64::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext64, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext64::__ns"]
        [::std::mem::offset_of!(__darwin_mcontext64, __ns) - 288usize];
};
pub type mcontext_t = *mut __darwin_mcontext64;
pub type pthread_attr_t = __darwin_pthread_attr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_sigaltstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_size: __darwin_size_t,
    pub ss_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_sigaltstack"][::std::mem::size_of::<__darwin_sigaltstack>() - 24usize];
    ["Alignment of __darwin_sigaltstack"][::std::mem::align_of::<__darwin_sigaltstack>() - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_sp"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_sp) - 0usize];
    ["Offset of field: __darwin_sigaltstack::ss_size"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_size) - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_flags"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_flags) - 16usize];
};
pub type stack_t = __darwin_sigaltstack;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_ucontext {
    pub uc_onstack: ::std::os::raw::c_int,
    pub uc_sigmask: __darwin_sigset_t,
    pub uc_stack: __darwin_sigaltstack,
    pub uc_link: *mut __darwin_ucontext,
    pub uc_mcsize: __darwin_size_t,
    pub uc_mcontext: *mut __darwin_mcontext64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_ucontext"][::std::mem::size_of::<__darwin_ucontext>() - 56usize];
    ["Alignment of __darwin_ucontext"][::std::mem::align_of::<__darwin_ucontext>() - 8usize];
    ["Offset of field: __darwin_ucontext::uc_onstack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_onstack) - 0usize];
    ["Offset of field: __darwin_ucontext::uc_sigmask"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_sigmask) - 4usize];
    ["Offset of field: __darwin_ucontext::uc_stack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_stack) - 8usize];
    ["Offset of field: __darwin_ucontext::uc_link"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_link) - 32usize];
    ["Offset of field: __darwin_ucontext::uc_mcsize"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcsize) - 40usize];
    ["Offset of field: __darwin_ucontext::uc_mcontext"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcontext) - 48usize];
};
pub type ucontext_t = __darwin_ucontext;
pub type sigset_t = __darwin_sigset_t;
pub type uid_t = __darwin_uid_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    pub sigev_notify: ::std::os::raw::c_int,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_value: sigval,
    pub sigev_notify_function: ::std::option::Option<unsafe extern "C" fn(arg1: sigval)>,
    pub sigev_notify_attributes: *mut pthread_attr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigevent"][::std::mem::size_of::<sigevent>() - 32usize];
    ["Alignment of sigevent"][::std::mem::align_of::<sigevent>() - 8usize];
    ["Offset of field: sigevent::sigev_notify"]
        [::std::mem::offset_of!(sigevent, sigev_notify) - 0usize];
    ["Offset of field: sigevent::sigev_signo"]
        [::std::mem::offset_of!(sigevent, sigev_signo) - 4usize];
    ["Offset of field: sigevent::sigev_value"]
        [::std::mem::offset_of!(sigevent, sigev_value) - 8usize];
    ["Offset of field: sigevent::sigev_notify_function"]
        [::std::mem::offset_of!(sigevent, sigev_notify_function) - 16usize];
    ["Offset of field: sigevent::sigev_notify_attributes"]
        [::std::mem::offset_of!(sigevent, sigev_notify_attributes) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_pid: pid_t,
    pub si_uid: uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_value: sigval,
    pub si_band: ::std::os::raw::c_long,
    pub __pad: [::std::os::raw::c_ulong; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __siginfo"][::std::mem::size_of::<__siginfo>() - 104usize];
    ["Alignment of __siginfo"][::std::mem::align_of::<__siginfo>() - 8usize];
    ["Offset of field: __siginfo::si_signo"][::std::mem::offset_of!(__siginfo, si_signo) - 0usize];
    ["Offset of field: __siginfo::si_errno"][::std::mem::offset_of!(__siginfo, si_errno) - 4usize];
    ["Offset of field: __siginfo::si_code"][::std::mem::offset_of!(__siginfo, si_code) - 8usize];
    ["Offset of field: __siginfo::si_pid"][::std::mem::offset_of!(__siginfo, si_pid) - 12usize];
    ["Offset of field: __siginfo::si_uid"][::std::mem::offset_of!(__siginfo, si_uid) - 16usize];
    ["Offset of field: __siginfo::si_status"]
        [::std::mem::offset_of!(__siginfo, si_status) - 20usize];
    ["Offset of field: __siginfo::si_addr"][::std::mem::offset_of!(__siginfo, si_addr) - 24usize];
    ["Offset of field: __siginfo::si_value"][::std::mem::offset_of!(__siginfo, si_value) - 32usize];
    ["Offset of field: __siginfo::si_band"][::std::mem::offset_of!(__siginfo, si_band) - 40usize];
    ["Offset of field: __siginfo::__pad"][::std::mem::offset_of!(__siginfo, __pad) - 48usize];
};
pub type siginfo_t = __siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __sigaction_u {
    pub __sa_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub __sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut __siginfo,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction_u"][::std::mem::size_of::<__sigaction_u>() - 8usize];
    ["Alignment of __sigaction_u"][::std::mem::align_of::<__sigaction_u>() - 8usize];
    ["Offset of field: __sigaction_u::__sa_handler"]
        [::std::mem::offset_of!(__sigaction_u, __sa_handler) - 0usize];
    ["Offset of field: __sigaction_u::__sa_sigaction"]
        [::std::mem::offset_of!(__sigaction_u, __sa_sigaction) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_tramp: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: ::std::os::raw::c_int,
            arg3: ::std::os::raw::c_int,
            arg4: *mut siginfo_t,
            arg5: *mut ::std::os::raw::c_void,
        ),
    >,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction"][::std::mem::size_of::<__sigaction>() - 24usize];
    ["Alignment of __sigaction"][::std::mem::align_of::<__sigaction>() - 8usize];
    ["Offset of field: __sigaction::__sigaction_u"]
        [::std::mem::offset_of!(__sigaction, __sigaction_u) - 0usize];
    ["Offset of field: __sigaction::sa_tramp"]
        [::std::mem::offset_of!(__sigaction, sa_tramp) - 8usize];
    ["Offset of field: __sigaction::sa_mask"]
        [::std::mem::offset_of!(__sigaction, sa_mask) - 16usize];
    ["Offset of field: __sigaction::sa_flags"]
        [::std::mem::offset_of!(__sigaction, sa_flags) - 20usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 16usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
    ["Offset of field: sigaction::__sigaction_u"]
        [::std::mem::offset_of!(sigaction, __sigaction_u) - 0usize];
    ["Offset of field: sigaction::sa_mask"][::std::mem::offset_of!(sigaction, sa_mask) - 8usize];
    ["Offset of field: sigaction::sa_flags"][::std::mem::offset_of!(sigaction, sa_flags) - 12usize];
};
pub type sig_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigvec {
    pub sv_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub sv_mask: ::std::os::raw::c_int,
    pub sv_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigvec"][::std::mem::size_of::<sigvec>() - 16usize];
    ["Alignment of sigvec"][::std::mem::align_of::<sigvec>() - 8usize];
    ["Offset of field: sigvec::sv_handler"][::std::mem::offset_of!(sigvec, sv_handler) - 0usize];
    ["Offset of field: sigvec::sv_mask"][::std::mem::offset_of!(sigvec, sv_mask) - 8usize];
    ["Offset of field: sigvec::sv_flags"][::std::mem::offset_of!(sigvec, sv_flags) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack {
    pub ss_sp: *mut ::std::os::raw::c_char,
    pub ss_onstack: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigstack"][::std::mem::size_of::<sigstack>() - 16usize];
    ["Alignment of sigstack"][::std::mem::align_of::<sigstack>() - 8usize];
    ["Offset of field: sigstack::ss_sp"][::std::mem::offset_of!(sigstack, ss_sp) - 0usize];
    ["Offset of field: sigstack::ss_onstack"]
        [::std::mem::offset_of!(sigstack, ss_onstack) - 8usize];
};
unsafe extern "C" {
    pub fn signal(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        ),
    >;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __darwin_time_t,
    pub tv_usec: __darwin_suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type rlim_t = __uint64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage {
    pub ru_utime: timeval,
    pub ru_stime: timeval,
    pub ru_maxrss: ::std::os::raw::c_long,
    pub ru_ixrss: ::std::os::raw::c_long,
    pub ru_idrss: ::std::os::raw::c_long,
    pub ru_isrss: ::std::os::raw::c_long,
    pub ru_minflt: ::std::os::raw::c_long,
    pub ru_majflt: ::std::os::raw::c_long,
    pub ru_nswap: ::std::os::raw::c_long,
    pub ru_inblock: ::std::os::raw::c_long,
    pub ru_oublock: ::std::os::raw::c_long,
    pub ru_msgsnd: ::std::os::raw::c_long,
    pub ru_msgrcv: ::std::os::raw::c_long,
    pub ru_nsignals: ::std::os::raw::c_long,
    pub ru_nvcsw: ::std::os::raw::c_long,
    pub ru_nivcsw: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage"][::std::mem::size_of::<rusage>() - 144usize];
    ["Alignment of rusage"][::std::mem::align_of::<rusage>() - 8usize];
    ["Offset of field: rusage::ru_utime"][::std::mem::offset_of!(rusage, ru_utime) - 0usize];
    ["Offset of field: rusage::ru_stime"][::std::mem::offset_of!(rusage, ru_stime) - 16usize];
    ["Offset of field: rusage::ru_maxrss"][::std::mem::offset_of!(rusage, ru_maxrss) - 32usize];
    ["Offset of field: rusage::ru_ixrss"][::std::mem::offset_of!(rusage, ru_ixrss) - 40usize];
    ["Offset of field: rusage::ru_idrss"][::std::mem::offset_of!(rusage, ru_idrss) - 48usize];
    ["Offset of field: rusage::ru_isrss"][::std::mem::offset_of!(rusage, ru_isrss) - 56usize];
    ["Offset of field: rusage::ru_minflt"][::std::mem::offset_of!(rusage, ru_minflt) - 64usize];
    ["Offset of field: rusage::ru_majflt"][::std::mem::offset_of!(rusage, ru_majflt) - 72usize];
    ["Offset of field: rusage::ru_nswap"][::std::mem::offset_of!(rusage, ru_nswap) - 80usize];
    ["Offset of field: rusage::ru_inblock"][::std::mem::offset_of!(rusage, ru_inblock) - 88usize];
    ["Offset of field: rusage::ru_oublock"][::std::mem::offset_of!(rusage, ru_oublock) - 96usize];
    ["Offset of field: rusage::ru_msgsnd"][::std::mem::offset_of!(rusage, ru_msgsnd) - 104usize];
    ["Offset of field: rusage::ru_msgrcv"][::std::mem::offset_of!(rusage, ru_msgrcv) - 112usize];
    ["Offset of field: rusage::ru_nsignals"]
        [::std::mem::offset_of!(rusage, ru_nsignals) - 120usize];
    ["Offset of field: rusage::ru_nvcsw"][::std::mem::offset_of!(rusage, ru_nvcsw) - 128usize];
    ["Offset of field: rusage::ru_nivcsw"][::std::mem::offset_of!(rusage, ru_nivcsw) - 136usize];
};
pub type rusage_info_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v0 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v0"][::std::mem::size_of::<rusage_info_v0>() - 96usize];
    ["Alignment of rusage_info_v0"][::std::mem::align_of::<rusage_info_v0>() - 8usize];
    ["Offset of field: rusage_info_v0::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v0, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v0::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v0, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v0::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v0, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v0::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v0, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v0::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v0, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v0::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v0, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v0::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v0, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v0::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v0, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v0::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v0, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v0::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v0, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v0::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v0, ri_proc_exit_abstime) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v1 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v1"][::std::mem::size_of::<rusage_info_v1>() - 144usize];
    ["Alignment of rusage_info_v1"][::std::mem::align_of::<rusage_info_v1>() - 8usize];
    ["Offset of field: rusage_info_v1::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v1, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v1::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v1::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v1::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v1::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v1::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v1, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v1::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v1, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v1::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v1, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v1::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v1, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v1::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v1::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v1::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v1::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v1::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v1::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v1::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v1::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_elapsed_abstime) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v2 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v2"][::std::mem::size_of::<rusage_info_v2>() - 160usize];
    ["Alignment of rusage_info_v2"][::std::mem::align_of::<rusage_info_v2>() - 8usize];
    ["Offset of field: rusage_info_v2::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v2, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v2::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v2::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v2::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v2::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v2::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v2, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v2::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v2, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v2::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v2, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v2::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v2, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v2::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v2::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v2::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v2::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v2::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v2::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v2::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v2::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v2::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v2, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v2::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v2, ri_diskio_byteswritten) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v3 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v3"][::std::mem::size_of::<rusage_info_v3>() - 232usize];
    ["Alignment of rusage_info_v3"][::std::mem::align_of::<rusage_info_v3>() - 8usize];
    ["Offset of field: rusage_info_v3::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v3, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v3::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v3::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v3::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v3::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v3::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v3, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v3::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v3, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v3::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v3, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v3::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v3, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v3::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v3::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v3::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v3::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v3::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v3::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v3::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v3::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v3::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v3, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v3::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v3, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v3::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v3::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_serviced_system_time) - 224usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v4 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v4"][::std::mem::size_of::<rusage_info_v4>() - 296usize];
    ["Alignment of rusage_info_v4"][::std::mem::align_of::<rusage_info_v4>() - 8usize];
    ["Offset of field: rusage_info_v4::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v4, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v4::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v4::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v4::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v4::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v4::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v4, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v4::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v4, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v4::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v4, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v4::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v4::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v4::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v4::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v4::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v4::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v4::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v4::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v4::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v4::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v4, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v4::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v4, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v4::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v4::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v4::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v4, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v4::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v4::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v4, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v4::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v4::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v4::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v4::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v4::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_runnable_time) - 288usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v5 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
    pub ri_flags: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v5"][::std::mem::size_of::<rusage_info_v5>() - 304usize];
    ["Alignment of rusage_info_v5"][::std::mem::align_of::<rusage_info_v5>() - 8usize];
    ["Offset of field: rusage_info_v5::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v5, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v5::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v5::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v5::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v5::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v5::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v5, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v5::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v5, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v5::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v5, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v5::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v5::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v5::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v5::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v5::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v5::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v5::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v5::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v5::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v5::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v5, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v5::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v5, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v5::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v5::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v5::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v5, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v5::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v5::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v5, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v5::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v5::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v5::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v5::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v5::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_runnable_time) - 288usize];
    ["Offset of field: rusage_info_v5::ri_flags"]
        [::std::mem::offset_of!(rusage_info_v5, ri_flags) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v6 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
    pub ri_flags: u64,
    pub ri_user_ptime: u64,
    pub ri_system_ptime: u64,
    pub ri_pinstructions: u64,
    pub ri_pcycles: u64,
    pub ri_energy_nj: u64,
    pub ri_penergy_nj: u64,
    pub ri_secure_time_in_system: u64,
    pub ri_secure_ptime_in_system: u64,
    pub ri_neural_footprint: u64,
    pub ri_lifetime_max_neural_footprint: u64,
    pub ri_interval_max_neural_footprint: u64,
    pub ri_reserved: [u64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v6"][::std::mem::size_of::<rusage_info_v6>() - 464usize];
    ["Alignment of rusage_info_v6"][::std::mem::align_of::<rusage_info_v6>() - 8usize];
    ["Offset of field: rusage_info_v6::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v6, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v6::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v6::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v6::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v6::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v6::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v6::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v6, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v6::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v6, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v6::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v6::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v6::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v6::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v6::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v6::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v6::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v6::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v6::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v6::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v6, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v6::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v6, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v6::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v6::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v6::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v6, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v6::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v6::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v6, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v6::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v6::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v6::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v6::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v6::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_runnable_time) - 288usize];
    ["Offset of field: rusage_info_v6::ri_flags"]
        [::std::mem::offset_of!(rusage_info_v6, ri_flags) - 296usize];
    ["Offset of field: rusage_info_v6::ri_user_ptime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_user_ptime) - 304usize];
    ["Offset of field: rusage_info_v6::ri_system_ptime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_system_ptime) - 312usize];
    ["Offset of field: rusage_info_v6::ri_pinstructions"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pinstructions) - 320usize];
    ["Offset of field: rusage_info_v6::ri_pcycles"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pcycles) - 328usize];
    ["Offset of field: rusage_info_v6::ri_energy_nj"]
        [::std::mem::offset_of!(rusage_info_v6, ri_energy_nj) - 336usize];
    ["Offset of field: rusage_info_v6::ri_penergy_nj"]
        [::std::mem::offset_of!(rusage_info_v6, ri_penergy_nj) - 344usize];
    ["Offset of field: rusage_info_v6::ri_secure_time_in_system"]
        [::std::mem::offset_of!(rusage_info_v6, ri_secure_time_in_system) - 352usize];
    ["Offset of field: rusage_info_v6::ri_secure_ptime_in_system"]
        [::std::mem::offset_of!(rusage_info_v6, ri_secure_ptime_in_system) - 360usize];
    ["Offset of field: rusage_info_v6::ri_neural_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_neural_footprint) - 368usize];
    ["Offset of field: rusage_info_v6::ri_lifetime_max_neural_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_lifetime_max_neural_footprint) - 376usize];
    ["Offset of field: rusage_info_v6::ri_interval_max_neural_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interval_max_neural_footprint) - 384usize];
    ["Offset of field: rusage_info_v6::ri_reserved"]
        [::std::mem::offset_of!(rusage_info_v6, ri_reserved) - 392usize];
};
pub type rusage_info_current = rusage_info_v6;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rlimit {
    pub rlim_cur: rlim_t,
    pub rlim_max: rlim_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlimit"][::std::mem::size_of::<rlimit>() - 16usize];
    ["Alignment of rlimit"][::std::mem::align_of::<rlimit>() - 8usize];
    ["Offset of field: rlimit::rlim_cur"][::std::mem::offset_of!(rlimit, rlim_cur) - 0usize];
    ["Offset of field: rlimit::rlim_max"][::std::mem::offset_of!(rlimit, rlim_max) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct proc_rlimit_control_wakeupmon {
    pub wm_flags: u32,
    pub wm_rate: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of proc_rlimit_control_wakeupmon"]
        [::std::mem::size_of::<proc_rlimit_control_wakeupmon>() - 8usize];
    ["Alignment of proc_rlimit_control_wakeupmon"]
        [::std::mem::align_of::<proc_rlimit_control_wakeupmon>() - 4usize];
    ["Offset of field: proc_rlimit_control_wakeupmon::wm_flags"]
        [::std::mem::offset_of!(proc_rlimit_control_wakeupmon, wm_flags) - 0usize];
    ["Offset of field: proc_rlimit_control_wakeupmon::wm_rate"]
        [::std::mem::offset_of!(proc_rlimit_control_wakeupmon, wm_rate) - 4usize];
};
unsafe extern "C" {
    pub fn getpriority(arg1: ::std::os::raw::c_int, arg2: id_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getiopolicy_np(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getrlimit(arg1: ::std::os::raw::c_int, arg2: *mut rlimit) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getrusage(arg1: ::std::os::raw::c_int, arg2: *mut rusage) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setpriority(
        arg1: ::std::os::raw::c_int,
        arg2: id_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setiopolicy_np(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setrlimit(arg1: ::std::os::raw::c_int, arg2: *const rlimit) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union wait {
    pub w_status: ::std::os::raw::c_int,
    pub w_T: wait__bindgen_ty_1,
    pub w_S: wait__bindgen_ty_2,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_1"][::std::mem::size_of::<wait__bindgen_ty_1>() - 4usize];
    ["Alignment of wait__bindgen_ty_1"][::std::mem::align_of::<wait__bindgen_ty_1>() - 4usize];
};
impl wait__bindgen_ty_1 {
    #[inline]
    pub fn w_Termsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_w_Termsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Termsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                7u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Termsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Coredump(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_w_Coredump(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Coredump_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Coredump_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Retcode(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Retcode(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Retcode_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Retcode_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Filler(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_w_Filler(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Filler_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Filler_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        w_Termsig: ::std::os::raw::c_uint,
        w_Coredump: ::std::os::raw::c_uint,
        w_Retcode: ::std::os::raw::c_uint,
        w_Filler: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let w_Termsig: u32 = unsafe { ::std::mem::transmute(w_Termsig) };
            w_Termsig as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let w_Coredump: u32 = unsafe { ::std::mem::transmute(w_Coredump) };
            w_Coredump as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let w_Retcode: u32 = unsafe { ::std::mem::transmute(w_Retcode) };
            w_Retcode as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let w_Filler: u32 = unsafe { ::std::mem::transmute(w_Filler) };
            w_Filler as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_2 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_2"][::std::mem::size_of::<wait__bindgen_ty_2>() - 4usize];
    ["Alignment of wait__bindgen_ty_2"][::std::mem::align_of::<wait__bindgen_ty_2>() - 4usize];
};
impl wait__bindgen_ty_2 {
    #[inline]
    pub fn w_Stopval(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Stopval(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Stopval_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Stopval_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Stopsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Stopsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Stopsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Stopsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Filler(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_w_Filler(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Filler_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Filler_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        w_Stopval: ::std::os::raw::c_uint,
        w_Stopsig: ::std::os::raw::c_uint,
        w_Filler: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let w_Stopval: u32 = unsafe { ::std::mem::transmute(w_Stopval) };
            w_Stopval as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let w_Stopsig: u32 = unsafe { ::std::mem::transmute(w_Stopsig) };
            w_Stopsig as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let w_Filler: u32 = unsafe { ::std::mem::transmute(w_Filler) };
            w_Filler as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait"][::std::mem::size_of::<wait>() - 4usize];
    ["Alignment of wait"][::std::mem::align_of::<wait>() - 4usize];
    ["Offset of field: wait::w_status"][::std::mem::offset_of!(wait, w_status) - 0usize];
    ["Offset of field: wait::w_T"][::std::mem::offset_of!(wait, w_T) - 0usize];
    ["Offset of field: wait::w_S"][::std::mem::offset_of!(wait, w_S) - 0usize];
};
unsafe extern "C" {
    pub fn wait(arg1: *mut ::std::os::raw::c_int) -> pid_t;
}
unsafe extern "C" {
    pub fn waitpid(
        arg1: pid_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn waitid(
        arg1: idtype_t,
        arg2: id_t,
        arg3: *mut siginfo_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wait3(
        arg1: *mut ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: *mut rusage,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn wait4(
        arg1: pid_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut rusage,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
pub type ct_rune_t = __darwin_ct_rune_t;
pub type rune_t = __darwin_rune_t;
pub type wchar_t = __darwin_wchar_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub static mut __mb_cur_max: ::std::os::raw::c_int;
}
pub type malloc_type_id_t = ::std::os::raw::c_ulonglong;
unsafe extern "C" {
    pub fn malloc_type_malloc(
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_calloc(
        count: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_free(ptr: *mut ::std::os::raw::c_void, type_id: malloc_type_id_t);
}
unsafe extern "C" {
    pub fn malloc_type_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_valloc(
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_aligned_alloc(
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_posix_memalign(
        memptr: *mut *mut ::std::os::raw::c_void,
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _malloc_zone_t {
    _unused: [u8; 0],
}
pub type malloc_zone_t = _malloc_zone_t;
unsafe extern "C" {
    pub fn malloc_type_zone_malloc(
        zone: *mut malloc_zone_t,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_calloc(
        zone: *mut malloc_zone_t,
        count: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_free(
        zone: *mut malloc_zone_t,
        ptr: *mut ::std::os::raw::c_void,
        type_id: malloc_type_id_t,
    );
}
unsafe extern "C" {
    pub fn malloc_type_zone_realloc(
        zone: *mut malloc_zone_t,
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_valloc(
        zone: *mut malloc_zone_t,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_memalign(
        zone: *mut malloc_zone_t,
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __count: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn reallocf(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn abs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atof(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn div(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn labs(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn ldiv(arg1: ::std::os::raw::c_long, arg2: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn llabs(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lldiv(arg1: ::std::os::raw::c_longlong, arg2: ::std::os::raw::c_longlong) -> lldiv_t;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn quick_exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn strtod(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtol(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtold(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtoll(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoul(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoull(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn system(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcstombs(arg1: *mut ::std::os::raw::c_char, arg2: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wctomb(arg1: *mut ::std::os::raw::c_char, arg2: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _Exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn a64l(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn ecvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn erand48(arg1: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn fcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn grantpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        __size: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn jrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn l64a(arg1: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lcong48(arg1: *mut ::std::os::raw::c_ushort);
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mktemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn posix_openpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ptsname(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ptsname_r(
        fildes: ::std::os::raw::c_int,
        buffer: *mut ::std::os::raw::c_char,
        buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putenv(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rand_r(arg1: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}_realpath$DARWIN_EXTSN"]
    pub fn realpath(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn seed48(arg1: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __overwrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setkey(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setstate(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn srand48(arg1: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn srandom(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn unlockpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
pub type dev_t = __darwin_dev_t;
pub type mode_t = __darwin_mode_t;
unsafe extern "C" {
    pub fn arc4random() -> u32;
}
unsafe extern "C" {
    pub fn arc4random_addrandom(
        arg1: *mut ::std::os::raw::c_uchar,
        __datlen: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __nbytes: usize);
}
unsafe extern "C" {
    pub fn arc4random_stir();
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: u32) -> u32;
}
unsafe extern "C" {
    pub fn atexit_b(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bsearch_b(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn cgetcap(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn cgetclose() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetent(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetfirst(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetmatch(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetnext(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetnum(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetset(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetstr(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetustr(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn daemon(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn devname(arg1: dev_t, arg2: mode_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn devname_r(
        arg1: dev_t,
        arg2: mode_t,
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getbsize(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getloadavg(arg1: *mut f64, __nelem: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getprogname() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setprogname(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn heapsort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn heapsort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mergesort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mergesort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn psort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn psort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn psort_r(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        arg1: *mut ::std::os::raw::c_void,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn qsort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        arg1: *mut ::std::os::raw::c_void,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn radixsort(
        __base: *mut *const ::std::os::raw::c_uchar,
        __nel: ::std::os::raw::c_int,
        __table: *const ::std::os::raw::c_uchar,
        __endbyte: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rpmatch(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sradixsort(
        __base: *mut *const ::std::os::raw::c_uchar,
        __nel: ::std::os::raw::c_int,
        __table: *const ::std::os::raw::c_uchar,
        __endbyte: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sranddev();
}
unsafe extern "C" {
    pub fn srandomdev();
}
unsafe extern "C" {
    pub fn strtonum(
        __numstr: *const ::std::os::raw::c_char,
        __minval: ::std::os::raw::c_longlong,
        __maxval: ::std::os::raw::c_longlong,
        __errstrp: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoq(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub static mut suboptarg: *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_calloc(count: usize, size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn igraph_malloc(size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn igraph_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn igraph_free(ptr: *mut ::std::os::raw::c_void);
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
pub const igraph_error_type_t_IGRAPH_SUCCESS: igraph_error_type_t = 0;
pub const igraph_error_type_t_IGRAPH_FAILURE: igraph_error_type_t = 1;
pub const igraph_error_type_t_IGRAPH_ENOMEM: igraph_error_type_t = 2;
pub const igraph_error_type_t_IGRAPH_PARSEERROR: igraph_error_type_t = 3;
pub const igraph_error_type_t_IGRAPH_EINVAL: igraph_error_type_t = 4;
pub const igraph_error_type_t_IGRAPH_EXISTS: igraph_error_type_t = 5;
pub const igraph_error_type_t_IGRAPH_EINVVID: igraph_error_type_t = 7;
pub const igraph_error_type_t_IGRAPH_EINVEID: igraph_error_type_t = 8;
pub const igraph_error_type_t_IGRAPH_EINVMODE: igraph_error_type_t = 9;
pub const igraph_error_type_t_IGRAPH_EFILE: igraph_error_type_t = 10;
pub const igraph_error_type_t_IGRAPH_UNIMPLEMENTED: igraph_error_type_t = 12;
pub const igraph_error_type_t_IGRAPH_INTERRUPTED: igraph_error_type_t = 13;
pub const igraph_error_type_t_IGRAPH_DIVERGED: igraph_error_type_t = 14;
pub const igraph_error_type_t_IGRAPH_EARPACK: igraph_error_type_t = 15;
pub const igraph_error_type_t_IGRAPH_ENEGCYCLE: igraph_error_type_t = 37;
pub const igraph_error_type_t_IGRAPH_EINTERNAL: igraph_error_type_t = 38;
pub const igraph_error_type_t_IGRAPH_EATTRCOMBINE: igraph_error_type_t = 52;
pub const igraph_error_type_t_IGRAPH_EOVERFLOW: igraph_error_type_t = 55;
pub const igraph_error_type_t_IGRAPH_EUNDERFLOW: igraph_error_type_t = 58;
pub const igraph_error_type_t_IGRAPH_ERWSTUCK: igraph_error_type_t = 59;
pub const igraph_error_type_t_IGRAPH_STOP: igraph_error_type_t = 60;
pub const igraph_error_type_t_IGRAPH_ERANGE: igraph_error_type_t = 61;
pub const igraph_error_type_t_IGRAPH_ENOSOL: igraph_error_type_t = 62;
#[doc = " \\typedef igraph_error_type_t\n \\brief Error code type.\n These are the possible values returned by \\a igraph functions.\n Note that these are interesting only if you defined an error handler\n with \\ref igraph_set_error_handler(). Otherwise the program is aborted\n and the function causing the error never returns.\n\n \\enumval IGRAPH_SUCCESS The function successfully completed its task.\n \\enumval IGRAPH_FAILURE Something went wrong. You'll almost never\n    meet this error as normally more specific error codes are used.\n \\enumval IGRAPH_ENOMEM There wasn't enough memory to allocate\n    on the heap.\n \\enumval IGRAPH_PARSEERROR A parse error was found in a file.\n \\enumval IGRAPH_EINVAL A parameter's value is invalid. E.g. negative\n    number was specified as the number of vertices.\n \\enumval IGRAPH_EXISTS A graph/vertex/edge attribute is already\n    installed with the given name.\n \\enumval IGRAPH_EINVVID Invalid vertex ID, negative or too big.\n \\enumval IGRAPH_EINVEID Invalid edge ID, negative or too big.\n \\enumval IGRAPH_EINVMODE Invalid mode parameter.\n \\enumval IGRAPH_EFILE A file operation failed. E.g. a file doesn't exist,\n   or the user has no rights to open it.\n \\enumval IGRAPH_UNIMPLEMENTED Attempted to call an unimplemented or\n   disabled (at compile-time) function.\n \\enumval IGRAPH_DIVERGED A numeric algorithm failed to converge.\n \\enumval IGRAPH_ARPACK An error happened inside a calculation implemented\n   in ARPACK. The calculation involved is most likely an eigenvector-related\n   calculation.\n \\enumval IGRAPH_ENEGCYCLE Negative cycle detected while calculating shortest paths.\n \\enumval IGRAPH_EINTERNAL Internal error, likely a bug in igraph.\n \\enumval IGRAPH_EATTRCOMBINE Unimplemented attribute combination\n   method for the given attribute type.\n \\enumval IGRAPH_EOVERFLOW Integer or double overflow.\n \\enumval IGRAPH_EUNDERFLOW Integer or double underflow.\n \\enumval IGRAPH_ERWSTUCK Random walk got stuck.\n \\enumval IGRAPH_ERANGE Maximum vertex or edge count exceeded.\n \\enumval IGRAPH_ENOSOL Input problem has no solution."]
pub type igraph_error_type_t = ::std::os::raw::c_uint;
#[doc = " \\typedef igraph_error_t\n \\brief Return type for functions returning an error code.\n\n This type is used as the return type of igraph functions that return an\n error code. It is a type alias because \\type igraph_error_t used to be\n an \\c int, and was used slightly differenly than \\type igraph_error_type_t."]
pub use self::igraph_error_type_t as igraph_error_t;
#[doc = " \\typedef igraph_error_handler_t\n \\brief The type of error handler functions.\n\n This is the type of the error handler functions.\n\n \\param reason Textual description of the error.\n \\param file The source file in which the error is noticed.\n \\param line The number of the line in the source file which triggered\n   the error\n \\param igraph_errno The \\a igraph error code."]
pub type igraph_error_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        igraph_errno: igraph_error_t,
    ),
>;
unsafe extern "C" {
    #[doc = " \\var igraph_error_handler_abort\n \\brief Abort program in case of error.\n\n The default error handler, prints an error message and aborts the\n program."]
    pub fn igraph_error_handler_abort(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: igraph_error_t,
    ) -> !;
}
unsafe extern "C" {
    #[doc = " \\var igraph_error_handler_ignore\n \\brief Ignore errors.\n\n This error handler frees the temporarily allocated memory and returns\n with the error code."]
    pub fn igraph_error_handler_ignore(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        igraph_errno: igraph_error_t,
    );
}
unsafe extern "C" {
    #[doc = " \\var igraph_error_handler_printignore\n \\brief Print and ignore errors.\n\n Frees temporarily allocated memory, prints an error message to the\n standard error and returns with the error code."]
    pub fn igraph_error_handler_printignore(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        igraph_errno: igraph_error_t,
    );
}
unsafe extern "C" {
    pub fn igraph_set_error_handler(new_handler: igraph_error_handler_t) -> igraph_error_handler_t;
}
unsafe extern "C" {
    pub fn igraph_error(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        igraph_errno: igraph_error_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_errorf(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        igraph_errno: igraph_error_t,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_errorvf(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        igraph_errno: igraph_error_t,
        ap: va_list,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_strerror(igraph_errno: igraph_error_t) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_i_protectedPtr {
    pub level: ::std::os::raw::c_int,
    pub ptr: *mut ::std::os::raw::c_void,
    pub func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_i_protectedPtr"][::std::mem::size_of::<igraph_i_protectedPtr>() - 24usize];
    ["Alignment of igraph_i_protectedPtr"]
        [::std::mem::align_of::<igraph_i_protectedPtr>() - 8usize];
    ["Offset of field: igraph_i_protectedPtr::level"]
        [::std::mem::offset_of!(igraph_i_protectedPtr, level) - 0usize];
    ["Offset of field: igraph_i_protectedPtr::ptr"]
        [::std::mem::offset_of!(igraph_i_protectedPtr, ptr) - 8usize];
    ["Offset of field: igraph_i_protectedPtr::func"]
        [::std::mem::offset_of!(igraph_i_protectedPtr, func) - 16usize];
};
pub type igraph_finally_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
unsafe extern "C" {
    pub fn IGRAPH_FINALLY_REAL(func: igraph_finally_func_t, ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    #[doc = " \\function IGRAPH_FINALLY_CLEAN\n \\brief Signals clean deallocation of objects.\n\n Removes the specified number of objects from the stack of\n temporarily allocated objects. It is typically called\n immediately after manually destroying the objects:\n\n <programlisting>\n igraph_vector_t vector;\n igraph_vector_init(&amp;vector, 10);\n IGRAPH_FINALLY(igraph_vector_destroy, &amp;vector);\n // use vector\n igraph_vector_destroy(&amp;vector);\n IGRAPH_FINALLY_CLEAN(1);\n </programlisting>\n\n \\param num The number of objects to remove from the bookkeeping\n   stack."]
    pub fn IGRAPH_FINALLY_CLEAN(num: ::std::os::raw::c_int);
}
unsafe extern "C" {
    #[doc = " \\function IGRAPH_FINALLY_FREE\n \\brief Deallocates objects registered at the current level.\n\n Calls the destroy function for all objects in the current level\n of the stack of temporarily allocated objects, i.e. up to the\n nearest mark set by <code>IGRAPH_FINALLY_ENTER()</code>.\n This function must only be called from an error handler.\n It is \\em not appropriate to use it\n instead of destroying each unneeded object of a function, as it\n destroys the temporary objects of the caller function (and so on)\n as well."]
    pub fn IGRAPH_FINALLY_FREE();
}
unsafe extern "C" {
    pub fn IGRAPH_FINALLY_ENTER();
}
unsafe extern "C" {
    pub fn IGRAPH_FINALLY_EXIT();
}
unsafe extern "C" {
    #[doc = " \\function IGRAPH_FINALLY_STACK_SIZE\n \\brief The number of registered objects.\n\n Returns the number of objects in the stack of temporarily allocated\n objects. This function is handy if you write an own igraph routine and\n you want to make sure it handles errors properly. A properly written\n igraph routine should not leave pointers to temporarily allocated objects\n in the finally stack, because otherwise an \\ref IGRAPH_FINALLY_FREE call\n in another igraph function would result in freeing these objects as well\n (and this is really hard to debug, since the error will be not in that\n function that shows erroneous behaviour). Therefore, it is advised to\n write your own test cases and examine \\ref IGRAPH_FINALLY_STACK_SIZE\n before and after your test cases - the numbers should be equal."]
    pub fn IGRAPH_FINALLY_STACK_SIZE() -> ::std::os::raw::c_int;
}
#[doc = " \\typedef igraph_warning_handler_t\n \\brief The type of igraph warning handler functions.\n\n Currently it is defined to have the same type as\n \\ref igraph_error_handler_t, although the last (error code)\n argument is not used."]
pub type igraph_warning_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ),
>;
unsafe extern "C" {
    pub fn igraph_set_warning_handler(
        new_handler: igraph_warning_handler_t,
    ) -> igraph_warning_handler_t;
}
unsafe extern "C" {
    pub fn igraph_warning_handler_ignore(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn igraph_warning_handler_print(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn igraph_warning(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn igraph_warningf(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        ...
    );
}
#[doc = " \\typedef igraph_fatal_handler_t\n \\brief The type of igraph fatal error handler functions.\n\n Functions of this type \\em must not return. Typically they\n call <code>abort()</code> or do a <code>longjmp()</code>.\n\n \\param reason Textual description of the error.\n \\param file The source file in which the error is noticed.\n \\param line The number of the line in the source file which triggered the error."]
pub type igraph_fatal_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ),
>;
unsafe extern "C" {
    pub fn igraph_set_fatal_handler(new_handler: igraph_fatal_handler_t) -> igraph_fatal_handler_t;
}
unsafe extern "C" {
    #[doc = " \\var igraph_fatal_handler_abort\n \\brief Abort program in case of fatal error.\n\n The default fatal error handler, prints an error message and aborts the program."]
    pub fn igraph_fatal_handler_abort(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> !;
}
unsafe extern "C" {
    pub fn igraph_fatal(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> !;
}
unsafe extern "C" {
    pub fn igraph_fatalf(
        reason: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        ...
    ) -> !;
}
unsafe extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub fn __math_errhandling() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyf(arg1: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyd(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyl(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2l(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn modfl(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn ldexpf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ldexp(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexpl(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpl(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogbf(arg1: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ilogb(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ilogbl(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalbnf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn scalbn(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn scalbnl(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn scalblnf(arg1: f32, arg2: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn scalbln(arg1: f64, arg2: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn scalblnl(arg1: f64, arg2: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn fabsf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn fabs(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabsl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrt(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn hypot(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn powf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn pow(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn powl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrt(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceilf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceil(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceill(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn floor(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn nearbyint(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn rintf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn rint(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn rintl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lrintf(arg1: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lrint(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lrintl(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn roundf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn round(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn roundl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lroundf(arg1: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lround(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lroundl(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintf(arg1: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llrint(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llrintl(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llroundf(arg1: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llround(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llroundl(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn truncf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn trunc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn truncl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmod(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn remainder(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquof(arg1: f32, arg2: f32, arg3: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn remquo(arg1: f64, arg2: f64, arg3: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn remquol(arg1: f64, arg2: f64, arg3: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn copysignf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysign(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysignl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nanf(arg1: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn nan(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nanl(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nextafterf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafter(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafterl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttoward(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttowardf(arg1: f32, arg2: f64) -> f32;
}
unsafe extern "C" {
    pub fn nexttowardl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdimf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fdim(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdiml(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmax(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmin(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaf(arg1: f32, arg2: f32, arg3: f32) -> f32;
}
unsafe extern "C" {
    pub fn fma(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmal(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp10f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __exp10(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cospif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cospi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinpif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinpi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanpif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanpi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fabsf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __hypotf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __sqrtf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __ceilf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __floorf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __rintf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __roundf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __truncf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __copysignf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __nextafterf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fmaxf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fminf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fmaf16(
        arg1: __BindgenFloat16,
        arg2: __BindgenFloat16,
        arg3: __BindgenFloat16,
    ) -> __BindgenFloat16;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __float2 {
    pub __sinval: f32,
    pub __cosval: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __float2"][::std::mem::size_of::<__float2>() - 8usize];
    ["Alignment of __float2"][::std::mem::align_of::<__float2>() - 4usize];
    ["Offset of field: __float2::__sinval"][::std::mem::offset_of!(__float2, __sinval) - 0usize];
    ["Offset of field: __float2::__cosval"][::std::mem::offset_of!(__float2, __cosval) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __double2 {
    pub __sinval: f64,
    pub __cosval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __double2"][::std::mem::size_of::<__double2>() - 16usize];
    ["Alignment of __double2"][::std::mem::align_of::<__double2>() - 8usize];
    ["Offset of field: __double2::__sinval"][::std::mem::offset_of!(__double2, __sinval) - 0usize];
    ["Offset of field: __double2::__cosval"][::std::mem::offset_of!(__double2, __cosval) - 8usize];
};
unsafe extern "C" {
    pub fn __sincosf_stret(arg1: f32) -> __float2;
}
unsafe extern "C" {
    pub fn __sincos_stret(arg1: f64) -> __double2;
}
unsafe extern "C" {
    pub fn __sincospif_stret(arg1: f32) -> __float2;
}
unsafe extern "C" {
    pub fn __sincospi_stret(arg1: f64) -> __double2;
}
unsafe extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalb(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct exception {
    pub type_: ::std::os::raw::c_int,
    pub name: *mut ::std::os::raw::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exception"][::std::mem::size_of::<exception>() - 40usize];
    ["Alignment of exception"][::std::mem::align_of::<exception>() - 8usize];
    ["Offset of field: exception::type_"][::std::mem::offset_of!(exception, type_) - 0usize];
    ["Offset of field: exception::name"][::std::mem::offset_of!(exception, name) - 8usize];
    ["Offset of field: exception::arg1"][::std::mem::offset_of!(exception, arg1) - 16usize];
    ["Offset of field: exception::arg2"][::std::mem::offset_of!(exception, arg2) - 24usize];
    ["Offset of field: exception::retval"][::std::mem::offset_of!(exception, retval) - 32usize];
};
pub type rsize_t = ::std::os::raw::c_ulong;
pub type max_align_t = f64;
unsafe extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
unsafe extern "C" {
    pub static mut __stdinp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stderrp: *mut FILE;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
        arg2: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type off_t = __darwin_off_t;
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: usize,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, __len: *mut usize) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type igraph_int_t = i64;
pub type igraph_uint_t = u64;
pub type igraph_integer_t = igraph_int_t;
pub type igraph_real_t = f64;
pub type igraph_bool_t = bool;
unsafe extern "C" {
    pub fn igraph_real_printf(val: igraph_real_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_real_fprintf(file: *mut FILE, val: igraph_real_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_real_printf_aligned(
        width: ::std::os::raw::c_int,
        val: igraph_real_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_real_fprintf_aligned(
        file: *mut FILE,
        width: ::std::os::raw::c_int,
        val: igraph_real_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_real_snprintf(
        str_: *mut ::std::os::raw::c_char,
        size: usize,
        val: igraph_real_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_real_printf_precise(val: igraph_real_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_real_fprintf_precise(
        file: *mut FILE,
        val: igraph_real_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_real_snprintf_precise(
        str_: *mut ::std::os::raw::c_char,
        size: usize,
        val: igraph_real_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_rng_type_t {
    pub name: *const ::std::os::raw::c_char,
    pub bits: u8,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(state: *mut *mut ::std::os::raw::c_void) -> igraph_error_t,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(state: *mut ::std::os::raw::c_void)>,
    pub seed: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut ::std::os::raw::c_void,
            seed: igraph_uint_t,
        ) -> igraph_error_t,
    >,
    pub get: ::std::option::Option<
        unsafe extern "C" fn(state: *mut ::std::os::raw::c_void) -> igraph_uint_t,
    >,
    pub get_int: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut ::std::os::raw::c_void,
            l: igraph_int_t,
            h: igraph_int_t,
        ) -> igraph_int_t,
    >,
    pub get_real: ::std::option::Option<
        unsafe extern "C" fn(state: *mut ::std::os::raw::c_void) -> igraph_real_t,
    >,
    pub get_norm: ::std::option::Option<
        unsafe extern "C" fn(state: *mut ::std::os::raw::c_void) -> igraph_real_t,
    >,
    pub get_geom: ::std::option::Option<
        unsafe extern "C" fn(state: *mut ::std::os::raw::c_void, p: igraph_real_t) -> igraph_real_t,
    >,
    pub get_binom: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut ::std::os::raw::c_void,
            n: igraph_int_t,
            p: igraph_real_t,
        ) -> igraph_real_t,
    >,
    pub get_exp: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut ::std::os::raw::c_void,
            rate: igraph_real_t,
        ) -> igraph_real_t,
    >,
    pub get_gamma: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut ::std::os::raw::c_void,
            shape: igraph_real_t,
            scale: igraph_real_t,
        ) -> igraph_real_t,
    >,
    pub get_pois: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut ::std::os::raw::c_void,
            mu: igraph_real_t,
        ) -> igraph_real_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_rng_type_t"][::std::mem::size_of::<igraph_rng_type_t>() - 112usize];
    ["Alignment of igraph_rng_type_t"][::std::mem::align_of::<igraph_rng_type_t>() - 8usize];
    ["Offset of field: igraph_rng_type_t::name"]
        [::std::mem::offset_of!(igraph_rng_type_t, name) - 0usize];
    ["Offset of field: igraph_rng_type_t::bits"]
        [::std::mem::offset_of!(igraph_rng_type_t, bits) - 8usize];
    ["Offset of field: igraph_rng_type_t::init"]
        [::std::mem::offset_of!(igraph_rng_type_t, init) - 16usize];
    ["Offset of field: igraph_rng_type_t::destroy"]
        [::std::mem::offset_of!(igraph_rng_type_t, destroy) - 24usize];
    ["Offset of field: igraph_rng_type_t::seed"]
        [::std::mem::offset_of!(igraph_rng_type_t, seed) - 32usize];
    ["Offset of field: igraph_rng_type_t::get"]
        [::std::mem::offset_of!(igraph_rng_type_t, get) - 40usize];
    ["Offset of field: igraph_rng_type_t::get_int"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_int) - 48usize];
    ["Offset of field: igraph_rng_type_t::get_real"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_real) - 56usize];
    ["Offset of field: igraph_rng_type_t::get_norm"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_norm) - 64usize];
    ["Offset of field: igraph_rng_type_t::get_geom"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_geom) - 72usize];
    ["Offset of field: igraph_rng_type_t::get_binom"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_binom) - 80usize];
    ["Offset of field: igraph_rng_type_t::get_exp"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_exp) - 88usize];
    ["Offset of field: igraph_rng_type_t::get_gamma"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_gamma) - 96usize];
    ["Offset of field: igraph_rng_type_t::get_pois"]
        [::std::mem::offset_of!(igraph_rng_type_t, get_pois) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_rng_t {
    pub type_: *const igraph_rng_type_t,
    pub state: *mut ::std::os::raw::c_void,
    pub is_seeded: igraph_bool_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_rng_t"][::std::mem::size_of::<igraph_rng_t>() - 24usize];
    ["Alignment of igraph_rng_t"][::std::mem::align_of::<igraph_rng_t>() - 8usize];
    ["Offset of field: igraph_rng_t::type_"][::std::mem::offset_of!(igraph_rng_t, type_) - 0usize];
    ["Offset of field: igraph_rng_t::state"][::std::mem::offset_of!(igraph_rng_t, state) - 8usize];
    ["Offset of field: igraph_rng_t::is_seeded"]
        [::std::mem::offset_of!(igraph_rng_t, is_seeded) - 16usize];
};
unsafe extern "C" {
    pub fn igraph_rng_init(
        rng: *mut igraph_rng_t,
        type_: *const igraph_rng_type_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_rng_destroy(rng: *mut igraph_rng_t);
}
unsafe extern "C" {
    pub fn igraph_rng_seed(rng: *mut igraph_rng_t, seed: igraph_uint_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_rng_bits(rng: *const igraph_rng_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_rng_max(rng: *const igraph_rng_t) -> igraph_uint_t;
}
unsafe extern "C" {
    pub fn igraph_rng_name(rng: *const igraph_rng_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_rng_get_bool(rng: *mut igraph_rng_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_integer(
        rng: *mut igraph_rng_t,
        l: igraph_int_t,
        h: igraph_int_t,
    ) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_normal(
        rng: *mut igraph_rng_t,
        m: igraph_real_t,
        s: igraph_real_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_unif(
        rng: *mut igraph_rng_t,
        l: igraph_real_t,
        h: igraph_real_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_unif01(rng: *mut igraph_rng_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_geom(rng: *mut igraph_rng_t, p: igraph_real_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_binom(
        rng: *mut igraph_rng_t,
        n: igraph_int_t,
        p: igraph_real_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_exp(rng: *mut igraph_rng_t, rate: igraph_real_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_gamma(
        rng: *mut igraph_rng_t,
        shape: igraph_real_t,
        scale: igraph_real_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_rng_get_pois(rng: *mut igraph_rng_t, rate: igraph_real_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub static igraph_rngtype_glibc2: igraph_rng_type_t;
}
unsafe extern "C" {
    pub static igraph_rngtype_mt19937: igraph_rng_type_t;
}
unsafe extern "C" {
    pub static igraph_rngtype_pcg32: igraph_rng_type_t;
}
unsafe extern "C" {
    pub static igraph_rngtype_pcg64: igraph_rng_type_t;
}
unsafe extern "C" {
    pub fn igraph_rng_default() -> *mut igraph_rng_t;
}
unsafe extern "C" {
    pub fn igraph_rng_set_default(rng: *mut igraph_rng_t) -> *mut igraph_rng_t;
}
#[doc = " \\typedef igraph_progress_handler_t\n \\brief Type of progress handler functions\n\n This is the type of the igraph progress handler functions.\n There is currently one such predefined function,\n \\ref igraph_progress_handler_stderr(), but the user can\n write and set up more sophisticated ones.\n \\param message A string describing the function or algorithm\n     that is reporting the progress. Current igraph functions\n     always use the name \\p message argument if reporting from the\n     same function.\n \\param percent Numeric, the percentage that was completed by the\n     algorithm or function.\n \\param data User-defined data. Current igraph functions that\n     report progress pass a null pointer here. Users can\n     write their own progress handlers and functions with progress\n     reporting, and then pass some meaningfull context here.\n \\return If the return value of the progress handler is not\n     \\c IGRAPH_SUCCESS, then \\ref igraph_progress() returns the\n     error code from the progress handler intact. The \\ref IGRAPH_PROGRESS()\n     macro also frees all allocated memory."]
pub type igraph_progress_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        message: *const ::std::os::raw::c_char,
        percent: igraph_real_t,
        data: *mut ::std::os::raw::c_void,
    ) -> igraph_error_t,
>;
unsafe extern "C" {
    pub fn igraph_progress_handler_stderr(
        message: *const ::std::os::raw::c_char,
        percent: igraph_real_t,
        data: *mut ::std::os::raw::c_void,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_set_progress_handler(
        new_handler: igraph_progress_handler_t,
    ) -> igraph_progress_handler_t;
}
unsafe extern "C" {
    pub fn igraph_progress(
        message: *const ::std::os::raw::c_char,
        percent: igraph_real_t,
        data: *mut ::std::os::raw::c_void,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_progressf(
        message: *const ::std::os::raw::c_char,
        percent: igraph_real_t,
        data: *mut ::std::os::raw::c_void,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_setup() -> igraph_error_t;
}
#[doc = " \\typedef igraph_status_handler_t\n\n The type of the igraph status handler functions\n \\param message The status message.\n \\param data Additional context, with user-defined semantics.\n        Existing igraph functions pass a null pointer here.\n \\return Error code. The current calculation will abort if you return anything\n         else than \\c IGRAPH_SUCCESS here."]
pub type igraph_status_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        message: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
    ) -> igraph_error_t,
>;
unsafe extern "C" {
    pub fn igraph_status_handler_stderr(
        message: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_set_status_handler(
        new_handler: igraph_status_handler_t,
    ) -> igraph_status_handler_t;
}
unsafe extern "C" {
    pub fn igraph_status(
        message: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_statusf(
        message: *const ::std::os::raw::c_char,
        data: *mut ::std::os::raw::c_void,
        ...
    ) -> igraph_error_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_complex_t {
    pub dat: [igraph_real_t; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_complex_t"][::std::mem::size_of::<igraph_complex_t>() - 16usize];
    ["Alignment of igraph_complex_t"][::std::mem::align_of::<igraph_complex_t>() - 8usize];
    ["Offset of field: igraph_complex_t::dat"]
        [::std::mem::offset_of!(igraph_complex_t, dat) - 0usize];
};
unsafe extern "C" {
    pub fn igraph_complex(x: igraph_real_t, y: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_polar(r: igraph_real_t, theta: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_almost_equals(
        z1: igraph_complex_t,
        z2: igraph_complex_t,
        eps: igraph_real_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_complex_arg(z: igraph_complex_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_complex_abs(z: igraph_complex_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_complex_logabs(z: igraph_complex_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_complex_add(z1: igraph_complex_t, z2: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_sub(z1: igraph_complex_t, z2: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_mul(z1: igraph_complex_t, z2: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_div(z1: igraph_complex_t, z2: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_add_real(z: igraph_complex_t, x: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_add_imag(z: igraph_complex_t, y: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_sub_real(z: igraph_complex_t, x: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_sub_imag(z: igraph_complex_t, y: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_mul_real(z: igraph_complex_t, x: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_mul_imag(z: igraph_complex_t, y: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_div_real(z: igraph_complex_t, x: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_div_imag(z: igraph_complex_t, y: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_conj(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_neg(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_inv(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_sqrt(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_sqrt_real(x: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_exp(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_pow(z1: igraph_complex_t, z2: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_pow_real(z: igraph_complex_t, x: igraph_real_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_log(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_log10(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_log_b(z: igraph_complex_t, b: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_sin(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_cos(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_tan(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_sec(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_csc(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_cot(z: igraph_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_complex_printf(val: igraph_complex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_complex_fprintf(file: *mut FILE, val: igraph_complex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_complex_printf_aligned(
        width: ::std::os::raw::c_int,
        val: igraph_complex_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_complex_fprintf_aligned(
        file: *mut FILE,
        width: ::std::os::raw::c_int,
        val: igraph_complex_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_complex_snprintf(
        str_: *mut ::std::os::raw::c_char,
        size: usize,
        val: igraph_complex_t,
    ) -> ::std::os::raw::c_int;
}
pub const IGRAPH_UNDIRECTED: _bindgen_ty_1 = 0;
pub const IGRAPH_DIRECTED: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const IGRAPH_NO_MULTIPLE: _bindgen_ty_2 = 0;
pub const IGRAPH_MULTIPLE: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const IGRAPH_EDGE_UNLABELED: _bindgen_ty_3 = 0;
pub const IGRAPH_EDGE_LABELED: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const igraph_loops_t_IGRAPH_NO_LOOPS: igraph_loops_t = 0;
pub const igraph_loops_t_IGRAPH_LOOPS_TWICE: igraph_loops_t = 1;
pub const igraph_loops_t_IGRAPH_LOOPS_ONCE: igraph_loops_t = 2;
pub const igraph_loops_t_IGRAPH_LOOPS: igraph_loops_t = 1;
#[doc = " \\typedef igraph_loops_t\n \\brief How to interpret self-loops in undirected graphs?\n\n Controls the interpretation of self-loops in undirected graphs, typically\n in the context of adjacency matrices or degrees.\n\n </para><para>These constants are also used to improve readability in\n boolean contexts, with \\c IGRAPH_NO_LOOPS, equivalent to \\c false,\n signifying that loops should be ignored and \\c IGRAPH_LOOPS, equivalent\n to \\c true, that loops should be considered.\n\n \\enumval IGRAPH_NO_LOOPS Self-loops are ignored.\n \\enumval IGRAPH_LOOPS_TWICE Self-loops are considered, and counted twice\n    in undirected graphs. For example, a self-loop contributes two to the\n    degree of a vertex and to diagonal entries of adjacency matrices. This\n    is the standard interpretation in graph theory, thus \\c IGRAPH_LOOPS\n    serves as an alias for this option.\n \\enumval IGRAPH_LOOPS_ONCE Self-loops are considered, and counted only\n    once in undirected graphs."]
pub type igraph_loops_t = ::std::os::raw::c_uint;
pub const igraph_order_t_IGRAPH_ASCENDING: igraph_order_t = 0;
pub const igraph_order_t_IGRAPH_DESCENDING: igraph_order_t = 1;
pub type igraph_order_t = ::std::os::raw::c_uint;
pub const igraph_neimode_t_IGRAPH_OUT: igraph_neimode_t = 1;
pub const igraph_neimode_t_IGRAPH_IN: igraph_neimode_t = 2;
pub const igraph_neimode_t_IGRAPH_ALL: igraph_neimode_t = 3;
#[doc = " \\typedef igraph_neimode_t\n \\brief How to interpret edge directions in directed graphs?\n\n These \"neighbor mode\" constants are typically used to specify the treatment\n of edge directions in directed graphs, or which vertices to consider as\n adjacent to (i.e. neighbor of) a vertex. It is typically ignored in undirected\n graphs.\n\n \\enumval IGRAPH_OUT Follow edge directions in directed graphs, or consider\n    out-neighbors of vertices.\n \\enumval IGRAPH_IN Follow edges in the reverse direction in directed graphs,\n    or consider in-neighbors of vertices.\n \\enumval IGRAPH_ALL Ignore edge directions in directed graphs, or consider\n    all neighbours (both out and in-neighbors) of vertices."]
pub type igraph_neimode_t = ::std::os::raw::c_uint;
pub const igraph_connectedness_t_IGRAPH_WEAK: igraph_connectedness_t = 1;
pub const igraph_connectedness_t_IGRAPH_STRONG: igraph_connectedness_t = 2;
pub type igraph_connectedness_t = ::std::os::raw::c_uint;
pub const igraph_reciprocity_t_IGRAPH_RECIPROCITY_DEFAULT: igraph_reciprocity_t = 0;
pub const igraph_reciprocity_t_IGRAPH_RECIPROCITY_RATIO: igraph_reciprocity_t = 1;
pub type igraph_reciprocity_t = ::std::os::raw::c_uint;
pub const igraph_adjacency_t_IGRAPH_ADJ_DIRECTED: igraph_adjacency_t = 0;
pub const igraph_adjacency_t_IGRAPH_ADJ_UNDIRECTED: igraph_adjacency_t = 1;
pub const igraph_adjacency_t_IGRAPH_ADJ_UPPER: igraph_adjacency_t = 2;
pub const igraph_adjacency_t_IGRAPH_ADJ_LOWER: igraph_adjacency_t = 3;
pub const igraph_adjacency_t_IGRAPH_ADJ_MIN: igraph_adjacency_t = 4;
pub const igraph_adjacency_t_IGRAPH_ADJ_PLUS: igraph_adjacency_t = 5;
pub const igraph_adjacency_t_IGRAPH_ADJ_MAX: igraph_adjacency_t = 6;
pub type igraph_adjacency_t = ::std::os::raw::c_uint;
pub const igraph_star_mode_t_IGRAPH_STAR_OUT: igraph_star_mode_t = 0;
pub const igraph_star_mode_t_IGRAPH_STAR_IN: igraph_star_mode_t = 1;
pub const igraph_star_mode_t_IGRAPH_STAR_UNDIRECTED: igraph_star_mode_t = 2;
pub const igraph_star_mode_t_IGRAPH_STAR_MUTUAL: igraph_star_mode_t = 3;
pub type igraph_star_mode_t = ::std::os::raw::c_uint;
pub const igraph_wheel_mode_t_IGRAPH_WHEEL_OUT: igraph_wheel_mode_t = 0;
pub const igraph_wheel_mode_t_IGRAPH_WHEEL_IN: igraph_wheel_mode_t = 1;
pub const igraph_wheel_mode_t_IGRAPH_WHEEL_UNDIRECTED: igraph_wheel_mode_t = 2;
pub const igraph_wheel_mode_t_IGRAPH_WHEEL_MUTUAL: igraph_wheel_mode_t = 3;
pub type igraph_wheel_mode_t = ::std::os::raw::c_uint;
pub const igraph_tree_mode_t_IGRAPH_TREE_OUT: igraph_tree_mode_t = 0;
pub const igraph_tree_mode_t_IGRAPH_TREE_IN: igraph_tree_mode_t = 1;
pub const igraph_tree_mode_t_IGRAPH_TREE_UNDIRECTED: igraph_tree_mode_t = 2;
pub type igraph_tree_mode_t = ::std::os::raw::c_uint;
pub const igraph_get_adjacency_t_IGRAPH_GET_ADJACENCY_UPPER: igraph_get_adjacency_t = 0;
pub const igraph_get_adjacency_t_IGRAPH_GET_ADJACENCY_LOWER: igraph_get_adjacency_t = 1;
pub const igraph_get_adjacency_t_IGRAPH_GET_ADJACENCY_BOTH: igraph_get_adjacency_t = 2;
pub type igraph_get_adjacency_t = ::std::os::raw::c_uint;
pub const igraph_degseq_t_IGRAPH_DEGSEQ_CONFIGURATION: igraph_degseq_t = 0;
pub const igraph_degseq_t_IGRAPH_DEGSEQ_VL: igraph_degseq_t = 1;
pub const igraph_degseq_t_IGRAPH_DEGSEQ_FAST_HEUR_SIMPLE: igraph_degseq_t = 2;
pub const igraph_degseq_t_IGRAPH_DEGSEQ_CONFIGURATION_SIMPLE: igraph_degseq_t = 3;
pub const igraph_degseq_t_IGRAPH_DEGSEQ_EDGE_SWITCHING_SIMPLE: igraph_degseq_t = 4;
pub type igraph_degseq_t = ::std::os::raw::c_uint;
pub const igraph_realize_degseq_t_IGRAPH_REALIZE_DEGSEQ_SMALLEST: igraph_realize_degseq_t = 0;
pub const igraph_realize_degseq_t_IGRAPH_REALIZE_DEGSEQ_LARGEST: igraph_realize_degseq_t = 1;
pub const igraph_realize_degseq_t_IGRAPH_REALIZE_DEGSEQ_INDEX: igraph_realize_degseq_t = 2;
pub type igraph_realize_degseq_t = ::std::os::raw::c_uint;
pub const igraph_random_tree_t_IGRAPH_RANDOM_TREE_PRUFER: igraph_random_tree_t = 0;
pub const igraph_random_tree_t_IGRAPH_RANDOM_TREE_LERW: igraph_random_tree_t = 1;
pub type igraph_random_tree_t = ::std::os::raw::c_uint;
pub const igraph_edgeorder_type_t_IGRAPH_EDGEORDER_ID: igraph_edgeorder_type_t = 0;
pub const igraph_edgeorder_type_t_IGRAPH_EDGEORDER_FROM: igraph_edgeorder_type_t = 1;
pub const igraph_edgeorder_type_t_IGRAPH_EDGEORDER_TO: igraph_edgeorder_type_t = 2;
pub type igraph_edgeorder_type_t = ::std::os::raw::c_uint;
pub const igraph_to_directed_t_IGRAPH_TO_DIRECTED_ARBITRARY: igraph_to_directed_t = 0;
pub const igraph_to_directed_t_IGRAPH_TO_DIRECTED_MUTUAL: igraph_to_directed_t = 1;
pub const igraph_to_directed_t_IGRAPH_TO_DIRECTED_RANDOM: igraph_to_directed_t = 2;
pub const igraph_to_directed_t_IGRAPH_TO_DIRECTED_ACYCLIC: igraph_to_directed_t = 3;
pub type igraph_to_directed_t = ::std::os::raw::c_uint;
pub const igraph_to_undirected_t_IGRAPH_TO_UNDIRECTED_EACH: igraph_to_undirected_t = 0;
pub const igraph_to_undirected_t_IGRAPH_TO_UNDIRECTED_COLLAPSE: igraph_to_undirected_t = 1;
pub const igraph_to_undirected_t_IGRAPH_TO_UNDIRECTED_MUTUAL: igraph_to_undirected_t = 2;
pub type igraph_to_undirected_t = ::std::os::raw::c_uint;
pub const igraph_vconn_nei_t_IGRAPH_VCONN_NEI_ERROR: igraph_vconn_nei_t = 0;
pub const igraph_vconn_nei_t_IGRAPH_VCONN_NEI_NUMBER_OF_NODES: igraph_vconn_nei_t = 1;
pub const igraph_vconn_nei_t_IGRAPH_VCONN_NEI_IGNORE: igraph_vconn_nei_t = 2;
pub const igraph_vconn_nei_t_IGRAPH_VCONN_NEI_NEGATIVE: igraph_vconn_nei_t = 3;
pub type igraph_vconn_nei_t = ::std::os::raw::c_uint;
pub const igraph_spincomm_update_t_IGRAPH_SPINCOMM_UPDATE_SIMPLE: igraph_spincomm_update_t = 0;
pub const igraph_spincomm_update_t_IGRAPH_SPINCOMM_UPDATE_CONFIG: igraph_spincomm_update_t = 1;
pub type igraph_spincomm_update_t = ::std::os::raw::c_uint;
pub const igraph_transitivity_mode_t_IGRAPH_TRANSITIVITY_NAN: igraph_transitivity_mode_t = 0;
pub const igraph_transitivity_mode_t_IGRAPH_TRANSITIVITY_ZERO: igraph_transitivity_mode_t = 1;
pub type igraph_transitivity_mode_t = ::std::os::raw::c_uint;
pub const igraph_spinglass_implementation_t_IGRAPH_SPINCOMM_IMP_ORIG:
    igraph_spinglass_implementation_t = 0;
pub const igraph_spinglass_implementation_t_IGRAPH_SPINCOMM_IMP_NEG:
    igraph_spinglass_implementation_t = 1;
pub type igraph_spinglass_implementation_t = ::std::os::raw::c_uint;
pub const igraph_community_comparison_t_IGRAPH_COMMCMP_VI: igraph_community_comparison_t = 0;
pub const igraph_community_comparison_t_IGRAPH_COMMCMP_NMI: igraph_community_comparison_t = 1;
pub const igraph_community_comparison_t_IGRAPH_COMMCMP_SPLIT_JOIN: igraph_community_comparison_t =
    2;
pub const igraph_community_comparison_t_IGRAPH_COMMCMP_RAND: igraph_community_comparison_t = 3;
pub const igraph_community_comparison_t_IGRAPH_COMMCMP_ADJUSTED_RAND:
    igraph_community_comparison_t = 4;
pub type igraph_community_comparison_t = ::std::os::raw::c_uint;
pub const igraph_add_weights_t_IGRAPH_ADD_WEIGHTS_NO: igraph_add_weights_t = 0;
pub const igraph_add_weights_t_IGRAPH_ADD_WEIGHTS_YES: igraph_add_weights_t = 1;
pub const igraph_add_weights_t_IGRAPH_ADD_WEIGHTS_IF_PRESENT: igraph_add_weights_t = 2;
pub type igraph_add_weights_t = ::std::os::raw::c_uint;
pub const igraph_barabasi_algorithm_t_IGRAPH_BARABASI_BAG: igraph_barabasi_algorithm_t = 0;
pub const igraph_barabasi_algorithm_t_IGRAPH_BARABASI_PSUMTREE: igraph_barabasi_algorithm_t = 1;
pub const igraph_barabasi_algorithm_t_IGRAPH_BARABASI_PSUMTREE_MULTIPLE:
    igraph_barabasi_algorithm_t = 2;
pub type igraph_barabasi_algorithm_t = ::std::os::raw::c_uint;
pub const igraph_fas_algorithm_t_IGRAPH_FAS_EXACT_IP: igraph_fas_algorithm_t = 0;
pub const igraph_fas_algorithm_t_IGRAPH_FAS_APPROX_EADES: igraph_fas_algorithm_t = 1;
pub const igraph_fas_algorithm_t_IGRAPH_FAS_EXACT_IP_CG: igraph_fas_algorithm_t = 2;
pub const igraph_fas_algorithm_t_IGRAPH_FAS_EXACT_IP_TI: igraph_fas_algorithm_t = 3;
pub type igraph_fas_algorithm_t = ::std::os::raw::c_uint;
pub const igraph_fvs_algorithm_t_IGRAPH_FVS_EXACT_IP: igraph_fvs_algorithm_t = 0;
pub type igraph_fvs_algorithm_t = ::std::os::raw::c_uint;
pub const igraph_subgraph_implementation_t_IGRAPH_SUBGRAPH_AUTO: igraph_subgraph_implementation_t =
    0;
pub const igraph_subgraph_implementation_t_IGRAPH_SUBGRAPH_COPY_AND_DELETE:
    igraph_subgraph_implementation_t = 1;
pub const igraph_subgraph_implementation_t_IGRAPH_SUBGRAPH_CREATE_FROM_SCRATCH:
    igraph_subgraph_implementation_t = 2;
pub type igraph_subgraph_implementation_t = ::std::os::raw::c_uint;
pub const igraph_layout_grid_t_IGRAPH_LAYOUT_GRID: igraph_layout_grid_t = 0;
pub const igraph_layout_grid_t_IGRAPH_LAYOUT_NOGRID: igraph_layout_grid_t = 1;
pub const igraph_layout_grid_t_IGRAPH_LAYOUT_AUTOGRID: igraph_layout_grid_t = 2;
pub type igraph_layout_grid_t = ::std::os::raw::c_uint;
pub const igraph_random_walk_stuck_t_IGRAPH_RANDOM_WALK_STUCK_ERROR: igraph_random_walk_stuck_t = 0;
pub const igraph_random_walk_stuck_t_IGRAPH_RANDOM_WALK_STUCK_RETURN: igraph_random_walk_stuck_t =
    1;
pub type igraph_random_walk_stuck_t = ::std::os::raw::c_uint;
pub const igraph_voronoi_tiebreaker_t_IGRAPH_VORONOI_FIRST: igraph_voronoi_tiebreaker_t = 0;
pub const igraph_voronoi_tiebreaker_t_IGRAPH_VORONOI_LAST: igraph_voronoi_tiebreaker_t = 1;
pub const igraph_voronoi_tiebreaker_t_IGRAPH_VORONOI_RANDOM: igraph_voronoi_tiebreaker_t = 2;
pub type igraph_voronoi_tiebreaker_t = ::std::os::raw::c_uint;
pub const igraph_chung_lu_t_IGRAPH_CHUNG_LU_ORIGINAL: igraph_chung_lu_t = 0;
pub const igraph_chung_lu_t_IGRAPH_CHUNG_LU_MAXENT: igraph_chung_lu_t = 1;
pub const igraph_chung_lu_t_IGRAPH_CHUNG_LU_NR: igraph_chung_lu_t = 2;
pub type igraph_chung_lu_t = ::std::os::raw::c_uint;
pub const igraph_matrix_storage_t_IGRAPH_ROW_MAJOR: igraph_matrix_storage_t = 0;
pub const igraph_matrix_storage_t_IGRAPH_COLUMN_MAJOR: igraph_matrix_storage_t = 1;
pub type igraph_matrix_storage_t = ::std::os::raw::c_uint;
pub const igraph_mst_algorithm_t_IGRAPH_MST_AUTOMATIC: igraph_mst_algorithm_t = 0;
pub const igraph_mst_algorithm_t_IGRAPH_MST_UNWEIGHTED: igraph_mst_algorithm_t = 1;
pub const igraph_mst_algorithm_t_IGRAPH_MST_PRIM: igraph_mst_algorithm_t = 2;
pub const igraph_mst_algorithm_t_IGRAPH_MST_KRUSKAL: igraph_mst_algorithm_t = 3;
pub type igraph_mst_algorithm_t = ::std::os::raw::c_uint;
pub const igraph_product_t_IGRAPH_PRODUCT_CARTESIAN: igraph_product_t = 0;
pub const igraph_product_t_IGRAPH_PRODUCT_LEXICOGRAPHIC: igraph_product_t = 1;
pub const igraph_product_t_IGRAPH_PRODUCT_STRONG: igraph_product_t = 2;
pub const igraph_product_t_IGRAPH_PRODUCT_TENSOR: igraph_product_t = 3;
pub const igraph_product_t_IGRAPH_PRODUCT_MODULAR: igraph_product_t = 4;
pub type igraph_product_t = ::std::os::raw::c_uint;
pub const igraph_lpa_variant_t_IGRAPH_LPA_DOMINANCE: igraph_lpa_variant_t = 0;
pub const igraph_lpa_variant_t_IGRAPH_LPA_RETENTION: igraph_lpa_variant_t = 1;
pub const igraph_lpa_variant_t_IGRAPH_LPA_FAST: igraph_lpa_variant_t = 2;
#[doc = " \\typedef igraph_lpa_variant_t\n \\brief Label propagation algorithm variants of implementation\n\n Variants to run the label propagation algorithm.\n \\enumval IGRAPH_LPA_DOMINANCE Check for dominance of all nodes after each iteration\n \\enumval IGRAPH_LPA_RETENTION Keep current label if among dominant labels, only check if labels changed\n \\enumval IGRAPH_LPA_FAST Sample from dominant labels, only check neighbors"]
pub type igraph_lpa_variant_t = ::std::os::raw::c_uint;
#[doc = " Vector, dealing with arrays efficiently.\n \\ingroup types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_vector_t {
    pub stor_begin: *mut igraph_real_t,
    pub stor_end: *mut igraph_real_t,
    pub end: *mut igraph_real_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_vector_t"][::std::mem::size_of::<igraph_vector_t>() - 24usize];
    ["Alignment of igraph_vector_t"][::std::mem::align_of::<igraph_vector_t>() - 8usize];
    ["Offset of field: igraph_vector_t::stor_begin"]
        [::std::mem::offset_of!(igraph_vector_t, stor_begin) - 0usize];
    ["Offset of field: igraph_vector_t::stor_end"]
        [::std::mem::offset_of!(igraph_vector_t, stor_end) - 8usize];
    ["Offset of field: igraph_vector_t::end"]
        [::std::mem::offset_of!(igraph_vector_t, end) - 16usize];
};
#[doc = " Vector, dealing with arrays efficiently.\n \\ingroup types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_vector_char_t {
    pub stor_begin: *mut ::std::os::raw::c_char,
    pub stor_end: *mut ::std::os::raw::c_char,
    pub end: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_vector_char_t"][::std::mem::size_of::<igraph_vector_char_t>() - 24usize];
    ["Alignment of igraph_vector_char_t"][::std::mem::align_of::<igraph_vector_char_t>() - 8usize];
    ["Offset of field: igraph_vector_char_t::stor_begin"]
        [::std::mem::offset_of!(igraph_vector_char_t, stor_begin) - 0usize];
    ["Offset of field: igraph_vector_char_t::stor_end"]
        [::std::mem::offset_of!(igraph_vector_char_t, stor_end) - 8usize];
    ["Offset of field: igraph_vector_char_t::end"]
        [::std::mem::offset_of!(igraph_vector_char_t, end) - 16usize];
};
#[doc = " Vector, dealing with arrays efficiently.\n \\ingroup types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_vector_bool_t {
    pub stor_begin: *mut igraph_bool_t,
    pub stor_end: *mut igraph_bool_t,
    pub end: *mut igraph_bool_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_vector_bool_t"][::std::mem::size_of::<igraph_vector_bool_t>() - 24usize];
    ["Alignment of igraph_vector_bool_t"][::std::mem::align_of::<igraph_vector_bool_t>() - 8usize];
    ["Offset of field: igraph_vector_bool_t::stor_begin"]
        [::std::mem::offset_of!(igraph_vector_bool_t, stor_begin) - 0usize];
    ["Offset of field: igraph_vector_bool_t::stor_end"]
        [::std::mem::offset_of!(igraph_vector_bool_t, stor_end) - 8usize];
    ["Offset of field: igraph_vector_bool_t::end"]
        [::std::mem::offset_of!(igraph_vector_bool_t, end) - 16usize];
};
#[doc = " Vector, dealing with arrays efficiently.\n \\ingroup types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_vector_int_t {
    pub stor_begin: *mut igraph_int_t,
    pub stor_end: *mut igraph_int_t,
    pub end: *mut igraph_int_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_vector_int_t"][::std::mem::size_of::<igraph_vector_int_t>() - 24usize];
    ["Alignment of igraph_vector_int_t"][::std::mem::align_of::<igraph_vector_int_t>() - 8usize];
    ["Offset of field: igraph_vector_int_t::stor_begin"]
        [::std::mem::offset_of!(igraph_vector_int_t, stor_begin) - 0usize];
    ["Offset of field: igraph_vector_int_t::stor_end"]
        [::std::mem::offset_of!(igraph_vector_int_t, stor_end) - 8usize];
    ["Offset of field: igraph_vector_int_t::end"]
        [::std::mem::offset_of!(igraph_vector_int_t, end) - 16usize];
};
#[doc = " Vector, dealing with arrays efficiently.\n \\ingroup types"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_vector_complex_t {
    pub stor_begin: *mut igraph_complex_t,
    pub stor_end: *mut igraph_complex_t,
    pub end: *mut igraph_complex_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_vector_complex_t"][::std::mem::size_of::<igraph_vector_complex_t>() - 24usize];
    ["Alignment of igraph_vector_complex_t"]
        [::std::mem::align_of::<igraph_vector_complex_t>() - 8usize];
    ["Offset of field: igraph_vector_complex_t::stor_begin"]
        [::std::mem::offset_of!(igraph_vector_complex_t, stor_begin) - 0usize];
    ["Offset of field: igraph_vector_complex_t::stor_end"]
        [::std::mem::offset_of!(igraph_vector_complex_t, stor_end) - 8usize];
    ["Offset of field: igraph_vector_complex_t::end"]
        [::std::mem::offset_of!(igraph_vector_complex_t, end) - 16usize];
};
unsafe extern "C" {
    pub fn igraph_vector_init(v: *mut igraph_vector_t, size: igraph_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_init_array(
        v: *mut igraph_vector_t,
        data: *const igraph_real_t,
        length: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_init_copy(
        to: *mut igraph_vector_t,
        from: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_init_range(
        v: *mut igraph_vector_t,
        start: igraph_real_t,
        end: igraph_real_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_destroy(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_capacity(v: *const igraph_vector_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_get(v: *const igraph_vector_t, pos: igraph_int_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_get_ptr(
        v: *const igraph_vector_t,
        pos: igraph_int_t,
    ) -> *mut igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_set(v: *mut igraph_vector_t, pos: igraph_int_t, value: igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_vector_tail(v: *const igraph_vector_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_null(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_fill(v: *mut igraph_vector_t, e: igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_vector_range(
        v: *mut igraph_vector_t,
        start: igraph_real_t,
        end: igraph_real_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_view(data: *const igraph_real_t, length: igraph_int_t) -> igraph_vector_t;
}
unsafe extern "C" {
    pub fn igraph_vector_copy_to(v: *const igraph_vector_t, to: *mut igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_vector_update(
        to: *mut igraph_vector_t,
        from: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_append(
        to: *mut igraph_vector_t,
        from: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_swap(v1: *mut igraph_vector_t, v2: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_swap_elements(v: *mut igraph_vector_t, i: igraph_int_t, j: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_reverse(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_reverse_section(
        v: *mut igraph_vector_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_rotate_left(v: *mut igraph_vector_t, n: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_permute(
        v: *mut igraph_vector_t,
        ind: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_shuffle(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_add_constant(v: *mut igraph_vector_t, plus: igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_vector_scale(v: *mut igraph_vector_t, by: igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_vector_add(
        v1: *mut igraph_vector_t,
        v2: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_sub(
        v1: *mut igraph_vector_t,
        v2: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_mul(
        v1: *mut igraph_vector_t,
        v2: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_div(
        v1: *mut igraph_vector_t,
        v2: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_cumsum(
        to: *mut igraph_vector_t,
        from: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_abs(v: *mut igraph_vector_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_all_e(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_all_l(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_all_g(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_all_le(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_all_ge(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_lex_cmp(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_colex_cmp(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_lex_cmp_untyped(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_colex_cmp_untyped(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_min(v: *const igraph_vector_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_max(v: *const igraph_vector_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_which_min(v: *const igraph_vector_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_which_max(v: *const igraph_vector_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_minmax(
        v: *const igraph_vector_t,
        min: *mut igraph_real_t,
        max: *mut igraph_real_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_which_minmax(
        v: *const igraph_vector_t,
        which_min: *mut igraph_int_t,
        which_max: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_empty(v: *const igraph_vector_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_size(v: *const igraph_vector_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_isnull(v: *const igraph_vector_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_sum(v: *const igraph_vector_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_sumsq(v: *const igraph_vector_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_prod(v: *const igraph_vector_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_isininterval(
        v: *const igraph_vector_t,
        low: igraph_real_t,
        high: igraph_real_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_any_smaller(
        v: *const igraph_vector_t,
        limit: igraph_real_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_is_equal(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_maxdifference(
        m1: *const igraph_vector_t,
        m2: *const igraph_vector_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_contains(v: *const igraph_vector_t, e: igraph_real_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_search(
        v: *const igraph_vector_t,
        from: igraph_int_t,
        what: igraph_real_t,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_binsearch_slice(
        v: *const igraph_vector_t,
        what: igraph_real_t,
        pos: *mut igraph_int_t,
        start: igraph_int_t,
        end: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_binsearch(
        v: *const igraph_vector_t,
        what: igraph_real_t,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_contains_sorted(
        v: *const igraph_vector_t,
        what: igraph_real_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_clear(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_resize(v: *mut igraph_vector_t, new_size: igraph_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_resize_min(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_reserve(v: *mut igraph_vector_t, capacity: igraph_int_t)
        -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_push_back(v: *mut igraph_vector_t, e: igraph_real_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_pop_back(v: *mut igraph_vector_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_insert(
        v: *mut igraph_vector_t,
        pos: igraph_int_t,
        value: igraph_real_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_remove(v: *mut igraph_vector_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_remove_fast(v: *mut igraph_vector_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_remove_section(
        v: *mut igraph_vector_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_sort(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_reverse_sort(v: *mut igraph_vector_t);
}
unsafe extern "C" {
    pub fn igraph_vector_sort_ind(
        v: *const igraph_vector_t,
        inds: *mut igraph_vector_int_t,
        order: igraph_order_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_print(v: *const igraph_vector_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_fprint(v: *const igraph_vector_t, file: *mut FILE) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_printf(
        v: *const igraph_vector_t,
        format: *const ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_init_real(
        v: *mut igraph_vector_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_init_int(
        v: *mut igraph_vector_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_init_real_end(
        v: *mut igraph_vector_t,
        endmark: f64,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_init_int_end(
        v: *mut igraph_vector_t,
        endmark: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_move_interval(
        v: *mut igraph_vector_t,
        begin: igraph_int_t,
        end: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_filter_smaller(
        v: *mut igraph_vector_t,
        elem: igraph_real_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_get_interval(
        v: *const igraph_vector_t,
        res: *mut igraph_vector_t,
        from: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_difference_sorted(
        v1: *const igraph_vector_t,
        v2: *const igraph_vector_t,
        result: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_difference_and_intersection_sorted(
        v1: *const igraph_vector_t,
        v2: *const igraph_vector_t,
        vdiff12: *mut igraph_vector_t,
        vdiff21: *mut igraph_vector_t,
        vinter: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_intersect_sorted(
        v1: *const igraph_vector_t,
        v2: *const igraph_vector_t,
        result: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_intersection_size_sorted(
        v1: *const igraph_vector_t,
        v2: *const igraph_vector_t,
    ) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_index(
        v: *const igraph_vector_t,
        newv: *mut igraph_vector_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_index_in_place(
        v: *mut igraph_vector_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init(
        v: *mut igraph_vector_char_t,
        size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init_array(
        v: *mut igraph_vector_char_t,
        data: *const ::std::os::raw::c_char,
        length: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init_copy(
        to: *mut igraph_vector_char_t,
        from: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init_range(
        v: *mut igraph_vector_char_t,
        start: ::std::os::raw::c_char,
        end: ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_destroy(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_capacity(v: *const igraph_vector_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_get(
        v: *const igraph_vector_char_t,
        pos: igraph_int_t,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_get_ptr(
        v: *const igraph_vector_char_t,
        pos: igraph_int_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_set(
        v: *mut igraph_vector_char_t,
        pos: igraph_int_t,
        value: ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_tail(v: *const igraph_vector_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_null(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_fill(v: *mut igraph_vector_char_t, e: ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn igraph_vector_char_range(
        v: *mut igraph_vector_char_t,
        start: ::std::os::raw::c_char,
        end: ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_view(
        data: *const ::std::os::raw::c_char,
        length: igraph_int_t,
    ) -> igraph_vector_char_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_copy_to(
        v: *const igraph_vector_char_t,
        to: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_update(
        to: *mut igraph_vector_char_t,
        from: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_append(
        to: *mut igraph_vector_char_t,
        from: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_swap(v1: *mut igraph_vector_char_t, v2: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_swap_elements(
        v: *mut igraph_vector_char_t,
        i: igraph_int_t,
        j: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_reverse(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_reverse_section(
        v: *mut igraph_vector_char_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_rotate_left(v: *mut igraph_vector_char_t, n: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_permute(
        v: *mut igraph_vector_char_t,
        ind: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_shuffle(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_add_constant(
        v: *mut igraph_vector_char_t,
        plus: ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_scale(v: *mut igraph_vector_char_t, by: ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn igraph_vector_char_add(
        v1: *mut igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_sub(
        v1: *mut igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_mul(
        v1: *mut igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_div(
        v1: *mut igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_cumsum(
        to: *mut igraph_vector_char_t,
        from: *const igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_abs(v: *mut igraph_vector_char_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_all_e(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_all_l(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_all_g(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_all_le(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_all_ge(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_lex_cmp(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_char_colex_cmp(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_char_lex_cmp_untyped(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_char_colex_cmp_untyped(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_char_min(v: *const igraph_vector_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_max(v: *const igraph_vector_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_which_min(v: *const igraph_vector_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_which_max(v: *const igraph_vector_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_minmax(
        v: *const igraph_vector_char_t,
        min: *mut ::std::os::raw::c_char,
        max: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_which_minmax(
        v: *const igraph_vector_char_t,
        which_min: *mut igraph_int_t,
        which_max: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_empty(v: *const igraph_vector_char_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_size(v: *const igraph_vector_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_isnull(v: *const igraph_vector_char_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_sum(v: *const igraph_vector_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_sumsq(v: *const igraph_vector_char_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_prod(v: *const igraph_vector_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_isininterval(
        v: *const igraph_vector_char_t,
        low: ::std::os::raw::c_char,
        high: ::std::os::raw::c_char,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_any_smaller(
        v: *const igraph_vector_char_t,
        limit: ::std::os::raw::c_char,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_is_equal(
        lhs: *const igraph_vector_char_t,
        rhs: *const igraph_vector_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_maxdifference(
        m1: *const igraph_vector_char_t,
        m2: *const igraph_vector_char_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_contains(
        v: *const igraph_vector_char_t,
        e: ::std::os::raw::c_char,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_search(
        v: *const igraph_vector_char_t,
        from: igraph_int_t,
        what: ::std::os::raw::c_char,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_binsearch_slice(
        v: *const igraph_vector_char_t,
        what: ::std::os::raw::c_char,
        pos: *mut igraph_int_t,
        start: igraph_int_t,
        end: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_binsearch(
        v: *const igraph_vector_char_t,
        what: ::std::os::raw::c_char,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_contains_sorted(
        v: *const igraph_vector_char_t,
        what: ::std::os::raw::c_char,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_clear(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_resize(
        v: *mut igraph_vector_char_t,
        new_size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_resize_min(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_reserve(
        v: *mut igraph_vector_char_t,
        capacity: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_push_back(
        v: *mut igraph_vector_char_t,
        e: ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_pop_back(v: *mut igraph_vector_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_vector_char_insert(
        v: *mut igraph_vector_char_t,
        pos: igraph_int_t,
        value: ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_remove(v: *mut igraph_vector_char_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_remove_fast(v: *mut igraph_vector_char_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_remove_section(
        v: *mut igraph_vector_char_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_char_sort(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_reverse_sort(v: *mut igraph_vector_char_t);
}
unsafe extern "C" {
    pub fn igraph_vector_char_sort_ind(
        v: *const igraph_vector_char_t,
        inds: *mut igraph_vector_int_t,
        order: igraph_order_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_print(v: *const igraph_vector_char_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_fprint(
        v: *const igraph_vector_char_t,
        file: *mut FILE,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_printf(
        v: *const igraph_vector_char_t,
        format: *const ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init_real(
        v: *mut igraph_vector_char_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init_int(
        v: *mut igraph_vector_char_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init_real_end(
        v: *mut igraph_vector_char_t,
        endmark: f64,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_init_int_end(
        v: *mut igraph_vector_char_t,
        endmark: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_move_interval(
        v: *mut igraph_vector_char_t,
        begin: igraph_int_t,
        end: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_filter_smaller(
        v: *mut igraph_vector_char_t,
        elem: ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_get_interval(
        v: *const igraph_vector_char_t,
        res: *mut igraph_vector_char_t,
        from: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_difference_sorted(
        v1: *const igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
        result: *mut igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_difference_and_intersection_sorted(
        v1: *const igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
        vdiff12: *mut igraph_vector_char_t,
        vdiff21: *mut igraph_vector_char_t,
        vinter: *mut igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_intersect_sorted(
        v1: *const igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
        result: *mut igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_intersection_size_sorted(
        v1: *const igraph_vector_char_t,
        v2: *const igraph_vector_char_t,
    ) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_index(
        v: *const igraph_vector_char_t,
        newv: *mut igraph_vector_char_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_char_index_in_place(
        v: *mut igraph_vector_char_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_init(
        v: *mut igraph_vector_bool_t,
        size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_init_array(
        v: *mut igraph_vector_bool_t,
        data: *const igraph_bool_t,
        length: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_init_copy(
        to: *mut igraph_vector_bool_t,
        from: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_destroy(v: *mut igraph_vector_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_capacity(v: *const igraph_vector_bool_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_get(
        v: *const igraph_vector_bool_t,
        pos: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_get_ptr(
        v: *const igraph_vector_bool_t,
        pos: igraph_int_t,
    ) -> *mut igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_set(
        v: *mut igraph_vector_bool_t,
        pos: igraph_int_t,
        value: igraph_bool_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_bool_tail(v: *const igraph_vector_bool_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_null(v: *mut igraph_vector_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_fill(v: *mut igraph_vector_bool_t, e: igraph_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_view(
        data: *const igraph_bool_t,
        length: igraph_int_t,
    ) -> igraph_vector_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_copy_to(v: *const igraph_vector_bool_t, to: *mut igraph_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_update(
        to: *mut igraph_vector_bool_t,
        from: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_append(
        to: *mut igraph_vector_bool_t,
        from: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_swap(v1: *mut igraph_vector_bool_t, v2: *mut igraph_vector_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_swap_elements(
        v: *mut igraph_vector_bool_t,
        i: igraph_int_t,
        j: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_bool_reverse(v: *mut igraph_vector_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_reverse_section(
        v: *mut igraph_vector_bool_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_bool_rotate_left(v: *mut igraph_vector_bool_t, n: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_permute(
        v: *mut igraph_vector_bool_t,
        ind: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_shuffle(v: *mut igraph_vector_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_add_constant(v: *mut igraph_vector_bool_t, plus: igraph_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_scale(v: *mut igraph_vector_bool_t, by: igraph_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_add(
        v1: *mut igraph_vector_bool_t,
        v2: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_sub(
        v1: *mut igraph_vector_bool_t,
        v2: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_mul(
        v1: *mut igraph_vector_bool_t,
        v2: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_div(
        v1: *mut igraph_vector_bool_t,
        v2: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_cumsum(
        to: *mut igraph_vector_bool_t,
        from: *const igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_all_e(
        lhs: *const igraph_vector_bool_t,
        rhs: *const igraph_vector_bool_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_empty(v: *const igraph_vector_bool_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_size(v: *const igraph_vector_bool_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_isnull(v: *const igraph_vector_bool_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_sum(v: *const igraph_vector_bool_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_sumsq(v: *const igraph_vector_bool_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_prod(v: *const igraph_vector_bool_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_is_equal(
        lhs: *const igraph_vector_bool_t,
        rhs: *const igraph_vector_bool_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_contains(
        v: *const igraph_vector_bool_t,
        e: igraph_bool_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_search(
        v: *const igraph_vector_bool_t,
        from: igraph_int_t,
        what: igraph_bool_t,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_clear(v: *mut igraph_vector_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_resize(
        v: *mut igraph_vector_bool_t,
        new_size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_resize_min(v: *mut igraph_vector_bool_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_reserve(
        v: *mut igraph_vector_bool_t,
        capacity: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_push_back(
        v: *mut igraph_vector_bool_t,
        e: igraph_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_pop_back(v: *mut igraph_vector_bool_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_insert(
        v: *mut igraph_vector_bool_t,
        pos: igraph_int_t,
        value: igraph_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_remove(v: *mut igraph_vector_bool_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_remove_fast(v: *mut igraph_vector_bool_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_bool_remove_section(
        v: *mut igraph_vector_bool_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_bool_print(v: *const igraph_vector_bool_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_fprint(
        v: *const igraph_vector_bool_t,
        file: *mut FILE,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_printf(
        v: *const igraph_vector_bool_t,
        format: *const ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_init_real(
        v: *mut igraph_vector_bool_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_init_int(
        v: *mut igraph_vector_bool_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_init_real_end(
        v: *mut igraph_vector_bool_t,
        endmark: f64,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_init_int_end(
        v: *mut igraph_vector_bool_t,
        endmark: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_move_interval(
        v: *mut igraph_vector_bool_t,
        begin: igraph_int_t,
        end: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_get_interval(
        v: *const igraph_vector_bool_t,
        res: *mut igraph_vector_bool_t,
        from: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_index(
        v: *const igraph_vector_bool_t,
        newv: *mut igraph_vector_bool_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_bool_index_in_place(
        v: *mut igraph_vector_bool_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init(
        v: *mut igraph_vector_int_t,
        size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init_array(
        v: *mut igraph_vector_int_t,
        data: *const igraph_int_t,
        length: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init_copy(
        to: *mut igraph_vector_int_t,
        from: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init_range(
        v: *mut igraph_vector_int_t,
        start: igraph_int_t,
        end: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_destroy(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_capacity(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_get(v: *const igraph_vector_int_t, pos: igraph_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_get_ptr(
        v: *const igraph_vector_int_t,
        pos: igraph_int_t,
    ) -> *mut igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_set(
        v: *mut igraph_vector_int_t,
        pos: igraph_int_t,
        value: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_int_tail(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_null(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_fill(v: *mut igraph_vector_int_t, e: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_range(
        v: *mut igraph_vector_int_t,
        start: igraph_int_t,
        end: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_view(
        data: *const igraph_int_t,
        length: igraph_int_t,
    ) -> igraph_vector_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_copy_to(v: *const igraph_vector_int_t, to: *mut igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_update(
        to: *mut igraph_vector_int_t,
        from: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_append(
        to: *mut igraph_vector_int_t,
        from: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_swap(v1: *mut igraph_vector_int_t, v2: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_swap_elements(
        v: *mut igraph_vector_int_t,
        i: igraph_int_t,
        j: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_int_reverse(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_reverse_section(
        v: *mut igraph_vector_int_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_int_rotate_left(v: *mut igraph_vector_int_t, n: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_permute(
        v: *mut igraph_vector_int_t,
        ind: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_shuffle(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_add_constant(v: *mut igraph_vector_int_t, plus: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_scale(v: *mut igraph_vector_int_t, by: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_add(
        v1: *mut igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_sub(
        v1: *mut igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_mul(
        v1: *mut igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_div(
        v1: *mut igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_cumsum(
        to: *mut igraph_vector_int_t,
        from: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_abs(v: *mut igraph_vector_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_all_e(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_all_l(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_all_g(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_all_le(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_all_ge(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_lex_cmp(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_int_colex_cmp(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_int_lex_cmp_untyped(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_int_colex_cmp_untyped(
        lhs: *const ::std::os::raw::c_void,
        rhs: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn igraph_vector_int_min(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_max(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_which_min(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_which_max(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_minmax(
        v: *const igraph_vector_int_t,
        min: *mut igraph_int_t,
        max: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_int_which_minmax(
        v: *const igraph_vector_int_t,
        which_min: *mut igraph_int_t,
        which_max: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_int_empty(v: *const igraph_vector_int_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_size(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_isnull(v: *const igraph_vector_int_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_sum(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_sumsq(v: *const igraph_vector_int_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_prod(v: *const igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_isininterval(
        v: *const igraph_vector_int_t,
        low: igraph_int_t,
        high: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_any_smaller(
        v: *const igraph_vector_int_t,
        limit: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_is_equal(
        lhs: *const igraph_vector_int_t,
        rhs: *const igraph_vector_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_maxdifference(
        m1: *const igraph_vector_int_t,
        m2: *const igraph_vector_int_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_contains(
        v: *const igraph_vector_int_t,
        e: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_search(
        v: *const igraph_vector_int_t,
        from: igraph_int_t,
        what: igraph_int_t,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_binsearch_slice(
        v: *const igraph_vector_int_t,
        what: igraph_int_t,
        pos: *mut igraph_int_t,
        start: igraph_int_t,
        end: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_binsearch(
        v: *const igraph_vector_int_t,
        what: igraph_int_t,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_contains_sorted(
        v: *const igraph_vector_int_t,
        what: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_clear(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_resize(
        v: *mut igraph_vector_int_t,
        new_size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_resize_min(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_reserve(
        v: *mut igraph_vector_int_t,
        capacity: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_push_back(
        v: *mut igraph_vector_int_t,
        e: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_pop_back(v: *mut igraph_vector_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_insert(
        v: *mut igraph_vector_int_t,
        pos: igraph_int_t,
        value: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_remove(v: *mut igraph_vector_int_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_remove_fast(v: *mut igraph_vector_int_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_remove_section(
        v: *mut igraph_vector_int_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_int_sort(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_reverse_sort(v: *mut igraph_vector_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_int_sort_ind(
        v: *const igraph_vector_int_t,
        inds: *mut igraph_vector_int_t,
        order: igraph_order_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_print(v: *const igraph_vector_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_fprint(
        v: *const igraph_vector_int_t,
        file: *mut FILE,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_printf(
        v: *const igraph_vector_int_t,
        format: *const ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init_real(
        v: *mut igraph_vector_int_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init_int(
        v: *mut igraph_vector_int_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init_real_end(
        v: *mut igraph_vector_int_t,
        endmark: f64,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_init_int_end(
        v: *mut igraph_vector_int_t,
        endmark: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_move_interval(
        v: *mut igraph_vector_int_t,
        begin: igraph_int_t,
        end: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_filter_smaller(
        v: *mut igraph_vector_int_t,
        elem: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_get_interval(
        v: *const igraph_vector_int_t,
        res: *mut igraph_vector_int_t,
        from: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_difference_sorted(
        v1: *const igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
        result: *mut igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_difference_and_intersection_sorted(
        v1: *const igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
        vdiff12: *mut igraph_vector_int_t,
        vdiff21: *mut igraph_vector_int_t,
        vinter: *mut igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_intersect_sorted(
        v1: *const igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
        result: *mut igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_intersection_size_sorted(
        v1: *const igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
    ) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_index(
        v: *const igraph_vector_int_t,
        newv: *mut igraph_vector_int_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_index_in_place(
        v: *mut igraph_vector_int_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_init(
        v: *mut igraph_vector_complex_t,
        size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_init_array(
        v: *mut igraph_vector_complex_t,
        data: *const igraph_complex_t,
        length: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_init_copy(
        to: *mut igraph_vector_complex_t,
        from: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_destroy(v: *mut igraph_vector_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_capacity(v: *const igraph_vector_complex_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_get(
        v: *const igraph_vector_complex_t,
        pos: igraph_int_t,
    ) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_get_ptr(
        v: *const igraph_vector_complex_t,
        pos: igraph_int_t,
    ) -> *mut igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_set(
        v: *mut igraph_vector_complex_t,
        pos: igraph_int_t,
        value: igraph_complex_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_complex_tail(v: *const igraph_vector_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_null(v: *mut igraph_vector_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_fill(v: *mut igraph_vector_complex_t, e: igraph_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_view(
        data: *const igraph_complex_t,
        length: igraph_int_t,
    ) -> igraph_vector_complex_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_copy_to(
        v: *const igraph_vector_complex_t,
        to: *mut igraph_complex_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_complex_update(
        to: *mut igraph_vector_complex_t,
        from: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_append(
        to: *mut igraph_vector_complex_t,
        from: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_swap(
        v1: *mut igraph_vector_complex_t,
        v2: *mut igraph_vector_complex_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_complex_swap_elements(
        v: *mut igraph_vector_complex_t,
        i: igraph_int_t,
        j: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_complex_reverse(v: *mut igraph_vector_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_reverse_section(
        v: *mut igraph_vector_complex_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_complex_rotate_left(v: *mut igraph_vector_complex_t, n: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_permute(
        v: *mut igraph_vector_complex_t,
        ind: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_shuffle(v: *mut igraph_vector_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_add_constant(
        v: *mut igraph_vector_complex_t,
        plus: igraph_complex_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_complex_scale(v: *mut igraph_vector_complex_t, by: igraph_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_add(
        v1: *mut igraph_vector_complex_t,
        v2: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_sub(
        v1: *mut igraph_vector_complex_t,
        v2: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_mul(
        v1: *mut igraph_vector_complex_t,
        v2: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_div(
        v1: *mut igraph_vector_complex_t,
        v2: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_cumsum(
        to: *mut igraph_vector_complex_t,
        from: *const igraph_vector_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_all_e(
        lhs: *const igraph_vector_complex_t,
        rhs: *const igraph_vector_complex_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_empty(v: *const igraph_vector_complex_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_size(v: *const igraph_vector_complex_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_isnull(v: *const igraph_vector_complex_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_sum(v: *const igraph_vector_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_sumsq(v: *const igraph_vector_complex_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_prod(v: *const igraph_vector_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_is_equal(
        lhs: *const igraph_vector_complex_t,
        rhs: *const igraph_vector_complex_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_contains(
        v: *const igraph_vector_complex_t,
        e: igraph_complex_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_search(
        v: *const igraph_vector_complex_t,
        from: igraph_int_t,
        what: igraph_complex_t,
        pos: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_clear(v: *mut igraph_vector_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_resize(
        v: *mut igraph_vector_complex_t,
        new_size: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_resize_min(v: *mut igraph_vector_complex_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_reserve(
        v: *mut igraph_vector_complex_t,
        capacity: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_push_back(
        v: *mut igraph_vector_complex_t,
        e: igraph_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_pop_back(v: *mut igraph_vector_complex_t) -> igraph_complex_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_insert(
        v: *mut igraph_vector_complex_t,
        pos: igraph_int_t,
        value: igraph_complex_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_remove(v: *mut igraph_vector_complex_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_remove_fast(v: *mut igraph_vector_complex_t, elem: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_vector_complex_remove_section(
        v: *mut igraph_vector_complex_t,
        from: igraph_int_t,
        to: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_vector_complex_print(v: *const igraph_vector_complex_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_fprint(
        v: *const igraph_vector_complex_t,
        file: *mut FILE,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_real(
        v: *const igraph_vector_complex_t,
        real: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_imag(
        v: *const igraph_vector_complex_t,
        imag: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_realimag(
        v: *const igraph_vector_complex_t,
        real: *mut igraph_vector_t,
        imag: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_create(
        v: *mut igraph_vector_complex_t,
        real: *const igraph_vector_t,
        imag: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_create_polar(
        v: *mut igraph_vector_complex_t,
        r: *const igraph_vector_t,
        theta: *const igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_all_almost_e(
        lhs: *const igraph_vector_complex_t,
        rhs: *const igraph_vector_complex_t,
        eps: igraph_real_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_init_real(
        v: *mut igraph_vector_complex_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_init_int(
        v: *mut igraph_vector_complex_t,
        no: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_init_real_end(
        v: *mut igraph_vector_complex_t,
        endmark: f64,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_init_int_end(
        v: *mut igraph_vector_complex_t,
        endmark: ::std::os::raw::c_int,
        ...
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_move_interval(
        v: *mut igraph_vector_complex_t,
        begin: igraph_int_t,
        end: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_get_interval(
        v: *const igraph_vector_complex_t,
        res: *mut igraph_vector_complex_t,
        from: igraph_int_t,
        to: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_index(
        v: *const igraph_vector_complex_t,
        newv: *mut igraph_vector_complex_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_index_in_place(
        v: *mut igraph_vector_complex_t,
        idx: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_floor(
        from: *const igraph_vector_t,
        to: *mut igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_round(
        from: *const igraph_vector_t,
        to: *mut igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_all_almost_e(
        lhs: *const igraph_vector_t,
        rhs: *const igraph_vector_t,
        eps: igraph_real_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_zapsmall(v: *mut igraph_vector_t, tol: igraph_real_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_complex_zapsmall(
        v: *mut igraph_vector_complex_t,
        tol: igraph_real_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_is_nan(
        v: *const igraph_vector_t,
        is_nan: *mut igraph_vector_bool_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_vector_is_any_nan(v: *const igraph_vector_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_is_all_finite(v: *const igraph_vector_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_vector_int_pair_order(
        v: *const igraph_vector_int_t,
        v2: *const igraph_vector_int_t,
        res: *mut igraph_vector_int_t,
        maxval: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_i_vector_int_order(
        v: *const igraph_vector_int_t,
        res: *mut igraph_vector_int_t,
        maxval: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_i_vector_int_rank(
        v: *const igraph_vector_int_t,
        res: *mut igraph_vector_int_t,
        maxval: igraph_int_t,
    ) -> igraph_error_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_matrix_t {
    pub data: igraph_vector_t,
    pub nrow: igraph_int_t,
    pub ncol: igraph_int_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_matrix_t"][::std::mem::size_of::<igraph_matrix_t>() - 40usize];
    ["Alignment of igraph_matrix_t"][::std::mem::align_of::<igraph_matrix_t>() - 8usize];
    ["Offset of field: igraph_matrix_t::data"]
        [::std::mem::offset_of!(igraph_matrix_t, data) - 0usize];
    ["Offset of field: igraph_matrix_t::nrow"]
        [::std::mem::offset_of!(igraph_matrix_t, nrow) - 24usize];
    ["Offset of field: igraph_matrix_t::ncol"]
        [::std::mem::offset_of!(igraph_matrix_t, ncol) - 32usize];
};
unsafe extern "C" {
    pub fn igraph_matrix_init(
        m: *mut igraph_matrix_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_init_array(
        m: *mut igraph_matrix_t,
        data: *const igraph_real_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
        storage: igraph_matrix_storage_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_init_copy(
        to: *mut igraph_matrix_t,
        from: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_destroy(m: *mut igraph_matrix_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_capacity(m: *const igraph_matrix_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_get(
        m: *const igraph_matrix_t,
        row: igraph_int_t,
        col: igraph_int_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_get_ptr(
        m: *const igraph_matrix_t,
        row: igraph_int_t,
        col: igraph_int_t,
    ) -> *mut igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_set(
        m: *mut igraph_matrix_t,
        row: igraph_int_t,
        col: igraph_int_t,
        value: igraph_real_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_null(m: *mut igraph_matrix_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_fill(m: *mut igraph_matrix_t, e: igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_view(
        data: *const igraph_real_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_matrix_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_view_from_vector(
        v: *const igraph_vector_t,
        ncol: igraph_int_t,
    ) -> igraph_matrix_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_copy_to(
        m: *const igraph_matrix_t,
        to: *mut igraph_real_t,
        storage: igraph_matrix_storage_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_update(
        to: *mut igraph_matrix_t,
        from: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_rbind(
        to: *mut igraph_matrix_t,
        from: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_cbind(
        to: *mut igraph_matrix_t,
        from: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_swap(m1: *mut igraph_matrix_t, m2: *mut igraph_matrix_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_get_row(
        m: *const igraph_matrix_t,
        res: *mut igraph_vector_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_get_col(
        m: *const igraph_matrix_t,
        res: *mut igraph_vector_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_set_row(
        m: *mut igraph_matrix_t,
        v: *const igraph_vector_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_set_col(
        m: *mut igraph_matrix_t,
        v: *const igraph_vector_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_select_rows(
        m: *const igraph_matrix_t,
        res: *mut igraph_matrix_t,
        rows: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_select_cols(
        m: *const igraph_matrix_t,
        res: *mut igraph_matrix_t,
        cols: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_select_rows_cols(
        m: *const igraph_matrix_t,
        res: *mut igraph_matrix_t,
        rows: *const igraph_vector_int_t,
        cols: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_swap_rows(
        m: *mut igraph_matrix_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_swap_cols(
        m: *mut igraph_matrix_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_swap_rowcol(
        m: *mut igraph_matrix_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_transpose(m: *mut igraph_matrix_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_add(
        m1: *mut igraph_matrix_t,
        m2: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_sub(
        m1: *mut igraph_matrix_t,
        m2: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_mul_elements(
        m1: *mut igraph_matrix_t,
        m2: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_div_elements(
        m1: *mut igraph_matrix_t,
        m2: *const igraph_matrix_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_scale(m: *mut igraph_matrix_t, by: igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_add_constant(m: *mut igraph_matrix_t, plus: igraph_real_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_min(m: *const igraph_matrix_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_max(m: *const igraph_matrix_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_which_min(
        m: *const igraph_matrix_t,
        i: *mut igraph_int_t,
        j: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_which_max(
        m: *const igraph_matrix_t,
        i: *mut igraph_int_t,
        j: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_minmax(
        m: *const igraph_matrix_t,
        min: *mut igraph_real_t,
        max: *mut igraph_real_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_which_minmax(
        m: *const igraph_matrix_t,
        imin: *mut igraph_int_t,
        jmin: *mut igraph_int_t,
        imax: *mut igraph_int_t,
        jmax: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_all_e(
        lhs: *const igraph_matrix_t,
        rhs: *const igraph_matrix_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_all_l(
        lhs: *const igraph_matrix_t,
        rhs: *const igraph_matrix_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_all_g(
        lhs: *const igraph_matrix_t,
        rhs: *const igraph_matrix_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_all_le(
        lhs: *const igraph_matrix_t,
        rhs: *const igraph_matrix_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_all_ge(
        lhs: *const igraph_matrix_t,
        rhs: *const igraph_matrix_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_isnull(m: *const igraph_matrix_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_empty(m: *const igraph_matrix_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_size(m: *const igraph_matrix_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_nrow(m: *const igraph_matrix_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_ncol(m: *const igraph_matrix_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_is_symmetric(m: *const igraph_matrix_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_sum(m: *const igraph_matrix_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_prod(m: *const igraph_matrix_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_rowsum(
        m: *const igraph_matrix_t,
        res: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_colsum(
        m: *const igraph_matrix_t,
        res: *mut igraph_vector_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_is_equal(
        m1: *const igraph_matrix_t,
        m2: *const igraph_matrix_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_maxdifference(
        m1: *const igraph_matrix_t,
        m2: *const igraph_matrix_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_contains(m: *const igraph_matrix_t, e: igraph_real_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_search(
        m: *const igraph_matrix_t,
        from: igraph_int_t,
        what: igraph_real_t,
        pos: *mut igraph_int_t,
        row: *mut igraph_int_t,
        col: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_resize(
        m: *mut igraph_matrix_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_resize_min(m: *mut igraph_matrix_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_add_cols(m: *mut igraph_matrix_t, n: igraph_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_add_rows(m: *mut igraph_matrix_t, n: igraph_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_remove_col(m: *mut igraph_matrix_t, col: igraph_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_remove_row(m: *mut igraph_matrix_t, row: igraph_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_print(m: *const igraph_matrix_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_fprint(m: *const igraph_matrix_t, file: *mut FILE) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_printf(
        m: *const igraph_matrix_t,
        format: *const ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_permdelete_rows(
        m: *mut igraph_matrix_t,
        index: *mut igraph_int_t,
        nremove: igraph_int_t,
    ) -> igraph_error_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_matrix_int_t {
    pub data: igraph_vector_int_t,
    pub nrow: igraph_int_t,
    pub ncol: igraph_int_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_matrix_int_t"][::std::mem::size_of::<igraph_matrix_int_t>() - 40usize];
    ["Alignment of igraph_matrix_int_t"][::std::mem::align_of::<igraph_matrix_int_t>() - 8usize];
    ["Offset of field: igraph_matrix_int_t::data"]
        [::std::mem::offset_of!(igraph_matrix_int_t, data) - 0usize];
    ["Offset of field: igraph_matrix_int_t::nrow"]
        [::std::mem::offset_of!(igraph_matrix_int_t, nrow) - 24usize];
    ["Offset of field: igraph_matrix_int_t::ncol"]
        [::std::mem::offset_of!(igraph_matrix_int_t, ncol) - 32usize];
};
unsafe extern "C" {
    pub fn igraph_matrix_int_init(
        m: *mut igraph_matrix_int_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_init_array(
        m: *mut igraph_matrix_int_t,
        data: *const igraph_int_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
        storage: igraph_matrix_storage_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_init_copy(
        to: *mut igraph_matrix_int_t,
        from: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_destroy(m: *mut igraph_matrix_int_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_int_capacity(m: *const igraph_matrix_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_get(
        m: *const igraph_matrix_int_t,
        row: igraph_int_t,
        col: igraph_int_t,
    ) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_get_ptr(
        m: *const igraph_matrix_int_t,
        row: igraph_int_t,
        col: igraph_int_t,
    ) -> *mut igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_set(
        m: *mut igraph_matrix_int_t,
        row: igraph_int_t,
        col: igraph_int_t,
        value: igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_int_null(m: *mut igraph_matrix_int_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_int_fill(m: *mut igraph_matrix_int_t, e: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_int_view(
        data: *const igraph_int_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_matrix_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_view_from_vector(
        v: *const igraph_vector_int_t,
        ncol: igraph_int_t,
    ) -> igraph_matrix_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_copy_to(
        m: *const igraph_matrix_int_t,
        to: *mut igraph_int_t,
        storage: igraph_matrix_storage_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_int_update(
        to: *mut igraph_matrix_int_t,
        from: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_rbind(
        to: *mut igraph_matrix_int_t,
        from: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_cbind(
        to: *mut igraph_matrix_int_t,
        from: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_swap(m1: *mut igraph_matrix_int_t, m2: *mut igraph_matrix_int_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_int_get_row(
        m: *const igraph_matrix_int_t,
        res: *mut igraph_vector_int_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_get_col(
        m: *const igraph_matrix_int_t,
        res: *mut igraph_vector_int_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_set_row(
        m: *mut igraph_matrix_int_t,
        v: *const igraph_vector_int_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_set_col(
        m: *mut igraph_matrix_int_t,
        v: *const igraph_vector_int_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_select_rows(
        m: *const igraph_matrix_int_t,
        res: *mut igraph_matrix_int_t,
        rows: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_select_cols(
        m: *const igraph_matrix_int_t,
        res: *mut igraph_matrix_int_t,
        cols: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_select_rows_cols(
        m: *const igraph_matrix_int_t,
        res: *mut igraph_matrix_int_t,
        rows: *const igraph_vector_int_t,
        cols: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_swap_rows(
        m: *mut igraph_matrix_int_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_swap_cols(
        m: *mut igraph_matrix_int_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_swap_rowcol(
        m: *mut igraph_matrix_int_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_transpose(m: *mut igraph_matrix_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_add(
        m1: *mut igraph_matrix_int_t,
        m2: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_sub(
        m1: *mut igraph_matrix_int_t,
        m2: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_mul_elements(
        m1: *mut igraph_matrix_int_t,
        m2: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_div_elements(
        m1: *mut igraph_matrix_int_t,
        m2: *const igraph_matrix_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_scale(m: *mut igraph_matrix_int_t, by: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_int_add_constant(m: *mut igraph_matrix_int_t, plus: igraph_int_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_int_min(m: *const igraph_matrix_int_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_max(m: *const igraph_matrix_int_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_which_min(
        m: *const igraph_matrix_int_t,
        i: *mut igraph_int_t,
        j: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_int_which_max(
        m: *const igraph_matrix_int_t,
        i: *mut igraph_int_t,
        j: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_int_minmax(
        m: *const igraph_matrix_int_t,
        min: *mut igraph_int_t,
        max: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_int_which_minmax(
        m: *const igraph_matrix_int_t,
        imin: *mut igraph_int_t,
        jmin: *mut igraph_int_t,
        imax: *mut igraph_int_t,
        jmax: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_int_all_e(
        lhs: *const igraph_matrix_int_t,
        rhs: *const igraph_matrix_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_all_l(
        lhs: *const igraph_matrix_int_t,
        rhs: *const igraph_matrix_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_all_g(
        lhs: *const igraph_matrix_int_t,
        rhs: *const igraph_matrix_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_all_le(
        lhs: *const igraph_matrix_int_t,
        rhs: *const igraph_matrix_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_all_ge(
        lhs: *const igraph_matrix_int_t,
        rhs: *const igraph_matrix_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_isnull(m: *const igraph_matrix_int_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_empty(m: *const igraph_matrix_int_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_size(m: *const igraph_matrix_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_nrow(m: *const igraph_matrix_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_ncol(m: *const igraph_matrix_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_is_symmetric(m: *const igraph_matrix_int_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_sum(m: *const igraph_matrix_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_prod(m: *const igraph_matrix_int_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_rowsum(
        m: *const igraph_matrix_int_t,
        res: *mut igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_colsum(
        m: *const igraph_matrix_int_t,
        res: *mut igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_is_equal(
        m1: *const igraph_matrix_int_t,
        m2: *const igraph_matrix_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_maxdifference(
        m1: *const igraph_matrix_int_t,
        m2: *const igraph_matrix_int_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_contains(
        m: *const igraph_matrix_int_t,
        e: igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_search(
        m: *const igraph_matrix_int_t,
        from: igraph_int_t,
        what: igraph_int_t,
        pos: *mut igraph_int_t,
        row: *mut igraph_int_t,
        col: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_resize(
        m: *mut igraph_matrix_int_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_resize_min(m: *mut igraph_matrix_int_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_int_add_cols(
        m: *mut igraph_matrix_int_t,
        n: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_add_rows(
        m: *mut igraph_matrix_int_t,
        n: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_remove_col(
        m: *mut igraph_matrix_int_t,
        col: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_remove_row(
        m: *mut igraph_matrix_int_t,
        row: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_print(m: *const igraph_matrix_int_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_fprint(
        m: *const igraph_matrix_int_t,
        file: *mut FILE,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_printf(
        m: *const igraph_matrix_int_t,
        format: *const ::std::os::raw::c_char,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_int_permdelete_rows(
        m: *mut igraph_matrix_int_t,
        index: *mut igraph_int_t,
        nremove: igraph_int_t,
    ) -> igraph_error_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct igraph_matrix_char_t {
    pub data: igraph_vector_char_t,
    pub nrow: igraph_int_t,
    pub ncol: igraph_int_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of igraph_matrix_char_t"][::std::mem::size_of::<igraph_matrix_char_t>() - 40usize];
    ["Alignment of igraph_matrix_char_t"][::std::mem::align_of::<igraph_matrix_char_t>() - 8usize];
    ["Offset of field: igraph_matrix_char_t::data"]
        [::std::mem::offset_of!(igraph_matrix_char_t, data) - 0usize];
    ["Offset of field: igraph_matrix_char_t::nrow"]
        [::std::mem::offset_of!(igraph_matrix_char_t, nrow) - 24usize];
    ["Offset of field: igraph_matrix_char_t::ncol"]
        [::std::mem::offset_of!(igraph_matrix_char_t, ncol) - 32usize];
};
unsafe extern "C" {
    pub fn igraph_matrix_char_init(
        m: *mut igraph_matrix_char_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_init_array(
        m: *mut igraph_matrix_char_t,
        data: *const ::std::os::raw::c_char,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
        storage: igraph_matrix_storage_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_init_copy(
        to: *mut igraph_matrix_char_t,
        from: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_destroy(m: *mut igraph_matrix_char_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_char_capacity(m: *const igraph_matrix_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_get(
        m: *const igraph_matrix_char_t,
        row: igraph_int_t,
        col: igraph_int_t,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_get_ptr(
        m: *const igraph_matrix_char_t,
        row: igraph_int_t,
        col: igraph_int_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_set(
        m: *mut igraph_matrix_char_t,
        row: igraph_int_t,
        col: igraph_int_t,
        value: ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_char_null(m: *mut igraph_matrix_char_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_char_fill(m: *mut igraph_matrix_char_t, e: ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn igraph_matrix_char_view(
        data: *const ::std::os::raw::c_char,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_matrix_char_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_view_from_vector(
        v: *const igraph_vector_char_t,
        ncol: igraph_int_t,
    ) -> igraph_matrix_char_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_copy_to(
        m: *const igraph_matrix_char_t,
        to: *mut ::std::os::raw::c_char,
        storage: igraph_matrix_storage_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_char_update(
        to: *mut igraph_matrix_char_t,
        from: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_rbind(
        to: *mut igraph_matrix_char_t,
        from: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_cbind(
        to: *mut igraph_matrix_char_t,
        from: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_swap(m1: *mut igraph_matrix_char_t, m2: *mut igraph_matrix_char_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_char_get_row(
        m: *const igraph_matrix_char_t,
        res: *mut igraph_vector_char_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_get_col(
        m: *const igraph_matrix_char_t,
        res: *mut igraph_vector_char_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_set_row(
        m: *mut igraph_matrix_char_t,
        v: *const igraph_vector_char_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_set_col(
        m: *mut igraph_matrix_char_t,
        v: *const igraph_vector_char_t,
        index: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_select_rows(
        m: *const igraph_matrix_char_t,
        res: *mut igraph_matrix_char_t,
        rows: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_select_cols(
        m: *const igraph_matrix_char_t,
        res: *mut igraph_matrix_char_t,
        cols: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_select_rows_cols(
        m: *const igraph_matrix_char_t,
        res: *mut igraph_matrix_char_t,
        rows: *const igraph_vector_int_t,
        cols: *const igraph_vector_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_swap_rows(
        m: *mut igraph_matrix_char_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_swap_cols(
        m: *mut igraph_matrix_char_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_swap_rowcol(
        m: *mut igraph_matrix_char_t,
        i: igraph_int_t,
        j: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_transpose(m: *mut igraph_matrix_char_t) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_add(
        m1: *mut igraph_matrix_char_t,
        m2: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_sub(
        m1: *mut igraph_matrix_char_t,
        m2: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_mul_elements(
        m1: *mut igraph_matrix_char_t,
        m2: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_div_elements(
        m1: *mut igraph_matrix_char_t,
        m2: *const igraph_matrix_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_scale(m: *mut igraph_matrix_char_t, by: ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn igraph_matrix_char_add_constant(
        m: *mut igraph_matrix_char_t,
        plus: ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_char_min(m: *const igraph_matrix_char_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_max(m: *const igraph_matrix_char_t) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_which_min(
        m: *const igraph_matrix_char_t,
        i: *mut igraph_int_t,
        j: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_char_which_max(
        m: *const igraph_matrix_char_t,
        i: *mut igraph_int_t,
        j: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_char_minmax(
        m: *const igraph_matrix_char_t,
        min: *mut ::std::os::raw::c_char,
        max: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_char_which_minmax(
        m: *const igraph_matrix_char_t,
        imin: *mut igraph_int_t,
        jmin: *mut igraph_int_t,
        imax: *mut igraph_int_t,
        jmax: *mut igraph_int_t,
    );
}
unsafe extern "C" {
    pub fn igraph_matrix_char_all_e(
        lhs: *const igraph_matrix_char_t,
        rhs: *const igraph_matrix_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_all_l(
        lhs: *const igraph_matrix_char_t,
        rhs: *const igraph_matrix_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_all_g(
        lhs: *const igraph_matrix_char_t,
        rhs: *const igraph_matrix_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_all_le(
        lhs: *const igraph_matrix_char_t,
        rhs: *const igraph_matrix_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_all_ge(
        lhs: *const igraph_matrix_char_t,
        rhs: *const igraph_matrix_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_isnull(m: *const igraph_matrix_char_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_empty(m: *const igraph_matrix_char_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_size(m: *const igraph_matrix_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_nrow(m: *const igraph_matrix_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_ncol(m: *const igraph_matrix_char_t) -> igraph_int_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_is_symmetric(m: *const igraph_matrix_char_t) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_sum(m: *const igraph_matrix_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_prod(m: *const igraph_matrix_char_t) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_rowsum(
        m: *const igraph_matrix_char_t,
        res: *mut igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_colsum(
        m: *const igraph_matrix_char_t,
        res: *mut igraph_vector_char_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_is_equal(
        m1: *const igraph_matrix_char_t,
        m2: *const igraph_matrix_char_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_maxdifference(
        m1: *const igraph_matrix_char_t,
        m2: *const igraph_matrix_char_t,
    ) -> igraph_real_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_contains(
        m: *const igraph_matrix_char_t,
        e: ::std::os::raw::c_char,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_search(
        m: *const igraph_matrix_char_t,
        from: igraph_int_t,
        what: ::std::os::raw::c_char,
        pos: *mut igraph_int_t,
        row: *mut igraph_int_t,
        col: *mut igraph_int_t,
    ) -> igraph_bool_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_resize(
        m: *mut igraph_matrix_char_t,
        nrow: igraph_int_t,
        ncol: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_resize_min(m: *mut igraph_matrix_char_t);
}
unsafe extern "C" {
    pub fn igraph_matrix_char_add_cols(
        m: *mut igraph_matrix_char_t,
        n: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_add_rows(
        m: *mut igraph_matrix_char_t,
        n: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
    pub fn igraph_matrix_char_remove_col(
        m: *mut igraph_matrix_char_t,
        col: igraph_int_t,
    ) -> igraph_error_t;
}
unsafe extern "C" {
